zephyrproject-rtos/hal_nxp/dts/nxp/mcx/mcxa/pinctrl/MCXA577VPN-pinctrl.h
/*
 * NOTE: Autogenerated file by gen_soc_headers.py
 * for MCXA577VPN/signal_configuration.xml
 *
 * 
 */

#ifndef _ZEPHYR_DTS_BINDING_MCXA577VPN_
#define _ZEPHYR_DTS_BINDING_MCXA577VPN_

#define A15X_MUX(port, pin, mux)		\
	(((((port) - '0') & 0xF) << 28) |	\
	(((pin) & 0x3F) << 22) |		\
	(((mux) & 0xF) << 8))

#define P0_0 A15X_MUX('0',0,0) /* PT0_0 */
#define SWDIO_P0_0 A15X_MUX('0',0,1) /* PT0_0 */
#define TMS_P0_0 A15X_MUX('0',0,1) /* PT0_0 */
#define LPUART0_RTS_B_P0_0 A15X_MUX('0',0,2) /* PT0_0 */
#define LPSPI0_PCS0_P0_0 A15X_MUX('0',0,3) /* PT0_0 */
#define CT_INP0_P0_0 A15X_MUX('0',0,4) /* PT0_0 */
#define FLEXIO0_D0_P0_0 A15X_MUX('0',0,6) /* PT0_0 */
#define P0_1 A15X_MUX('0',1,0) /* PT0_1 */
#define SWCLK_P0_1 A15X_MUX('0',1,1) /* PT0_1 */
#define TCLK_P0_1 A15X_MUX('0',1,1) /* PT0_1 */
#define LPUART0_CTS_B_P0_1 A15X_MUX('0',1,2) /* PT0_1 */
#define LPSPI0_SDI_P0_1 A15X_MUX('0',1,3) /* PT0_1 */
#define CT_INP1_P0_1 A15X_MUX('0',1,4) /* PT0_1 */
#define FLEXIO0_D1_P0_1 A15X_MUX('0',1,6) /* PT0_1 */
#define P0_2 A15X_MUX('0',2,0) /* PT0_2 */
#define SWO_P0_2 A15X_MUX('0',2,1) /* PT0_2 */
#define TDO_P0_2 A15X_MUX('0',2,1) /* PT0_2 */
#define LPUART0_RXD_P0_2 A15X_MUX('0',2,2) /* PT0_2 */
#define LPSPI0_SCK_P0_2 A15X_MUX('0',2,3) /* PT0_2 */
#define CT0_MAT0_P0_2 A15X_MUX('0',2,4) /* PT0_2 */
#define UTICK_CAP0_P0_2 A15X_MUX('0',2,5) /* PT0_2 */
#define FLEXIO0_D2_P0_2 A15X_MUX('0',2,6) /* PT0_2 */
#define I3C0_PUR_P0_2 A15X_MUX('0',2,10) /* PT0_2 */
#define ADC0_A14_P0_3 A15X_MUX('0',3,0) /* PT0_3 */
#define P0_3 A15X_MUX('0',3,0) /* PT0_3 */
#define TDI_P0_3 A15X_MUX('0',3,1) /* PT0_3 */
#define LPUART0_TXD_P0_3 A15X_MUX('0',3,2) /* PT0_3 */
#define LPSPI0_SDO_P0_3 A15X_MUX('0',3,3) /* PT0_3 */
#define CT0_MAT1_P0_3 A15X_MUX('0',3,4) /* PT0_3 */
#define UTICK_CAP1_P0_3 A15X_MUX('0',3,5) /* PT0_3 */
#define FLEXIO0_D3_P0_3 A15X_MUX('0',3,6) /* PT0_3 */
#define CMP0_OUT_P0_3 A15X_MUX('0',3,8) /* PT0_3 */
#define WUU0_IN0_P0_4 A15X_MUX('0',4,0) /* PT0_4 */
#define P0_4 A15X_MUX('0',4,0) /* PT0_4 */
#define EWM0_IN_P0_4 A15X_MUX('0',4,1) /* PT0_4 */
#define CT0_MAT2_P0_4 A15X_MUX('0',4,4) /* PT0_4 */
#define UTICK_CAP2_P0_4 A15X_MUX('0',4,5) /* PT0_4 */
#define FLEXIO0_D4_P0_4 A15X_MUX('0',4,6) /* PT0_4 */
#define SMARTDMA_PIO0_P0_4 A15X_MUX('0',4,7) /* PT0_4 */
#define P0_5 A15X_MUX('0',5,0) /* PT0_5 */
#define EWM0_OUT_B_P0_5 A15X_MUX('0',5,1) /* PT0_5 */
#define CT0_MAT3_P0_5 A15X_MUX('0',5,4) /* PT0_5 */
#define UTICK_CAP3_P0_5 A15X_MUX('0',5,5) /* PT0_5 */
#define FLEXIO0_D5_P0_5 A15X_MUX('0',5,6) /* PT0_5 */
#define SMARTDMA_PIO1_P0_5 A15X_MUX('0',5,7) /* PT0_5 */
#define ADC0_A15_P0_6 A15X_MUX('0',6,0) /* PT0_6 */
#define P0_6 A15X_MUX('0',6,0) /* PT0_6 */
#define ISPMODE_N_P0_6 A15X_MUX('0',6,1) /* PT0_6 */
#define LPI2C0_HREQ_P0_6 A15X_MUX('0',6,2) /* PT0_6 */
#define LPSPI0_PCS1_P0_6 A15X_MUX('0',6,3) /* PT0_6 */
#define CT_INP2_P0_6 A15X_MUX('0',6,4) /* PT0_6 */
#define FLEXIO0_D6_P0_6 A15X_MUX('0',6,6) /* PT0_6 */
#define SMARTDMA_PIO2_P0_6 A15X_MUX('0',6,7) /* PT0_6 */
#define P0_7 A15X_MUX('0',7,0) /* PT0_7 */
#define CT_INP3_P0_7 A15X_MUX('0',7,4) /* PT0_7 */
#define FLEXIO0_D7_P0_7 A15X_MUX('0',7,6) /* PT0_7 */
#define SMARTDMA_PIO3_P0_7 A15X_MUX('0',7,7) /* PT0_7 */
#define P0_8 A15X_MUX('0',8,0) /* PT0_8 */
#define CT_INP0_P0_8 A15X_MUX('0',8,4) /* PT0_8 */
#define FLEXIO0_D0_P0_8 A15X_MUX('0',8,6) /* PT0_8 */
#define P0_9 A15X_MUX('0',9,0) /* PT0_9 */
#define CT_INP1_P0_9 A15X_MUX('0',9,4) /* PT0_9 */
#define FLEXIO0_D1_P0_9 A15X_MUX('0',9,6) /* PT0_9 */
#define P0_10 A15X_MUX('0',10,0) /* PT0_10 */
#define CT0_MAT0_P0_10 A15X_MUX('0',10,4) /* PT0_10 */
#define FLEXIO0_D2_P0_10 A15X_MUX('0',10,6) /* PT0_10 */
#define P0_11 A15X_MUX('0',11,0) /* PT0_11 */
#define LPI2C4_HREQ_P0_11 A15X_MUX('0',11,3) /* PT0_11 */
#define CT0_MAT1_P0_11 A15X_MUX('0',11,4) /* PT0_11 */
#define FLEXIO0_D3_P0_11 A15X_MUX('0',11,6) /* PT0_11 */
#define P0_12 A15X_MUX('0',12,0) /* PT0_12 */
#define LPI2C4_SDAS_P0_12 A15X_MUX('0',12,3) /* PT0_12 */
#define CT0_MAT2_P0_12 A15X_MUX('0',12,4) /* PT0_12 */
#define FLEXIO0_D4_P0_12 A15X_MUX('0',12,6) /* PT0_12 */
#define LPSPI4_PCS3_P0_12 A15X_MUX('0',12,8) /* PT0_12 */
#define P0_13 A15X_MUX('0',13,0) /* PT0_13 */
#define LPI2C4_SCLS_P0_13 A15X_MUX('0',13,3) /* PT0_13 */
#define CT0_MAT3_P0_13 A15X_MUX('0',13,4) /* PT0_13 */
#define FLEXIO0_D5_P0_13 A15X_MUX('0',13,6) /* PT0_13 */
#define LPSPI4_PCS2_P0_13 A15X_MUX('0',13,8) /* PT0_13 */
#define ADC0_A10_P0_14 A15X_MUX('0',14,0) /* PT0_14 */
#define P0_14 A15X_MUX('0',14,0) /* PT0_14 */
#define LPI2C4_SCL_P0_14 A15X_MUX('0',14,3) /* PT0_14 */
#define CT_INP2_P0_14 A15X_MUX('0',14,4) /* PT0_14 */
#define UTICK_CAP0_P0_14 A15X_MUX('0',14,5) /* PT0_14 */
#define FLEXIO0_D6_P0_14 A15X_MUX('0',14,6) /* PT0_14 */
#define SMARTDMA_PIO4_P0_14 A15X_MUX('0',14,7) /* PT0_14 */
#define LPSPI4_PCS1_P0_14 A15X_MUX('0',14,8) /* PT0_14 */
#define ADC0_A11_P0_15 A15X_MUX('0',15,0) /* PT0_15 */
#define P0_15 A15X_MUX('0',15,0) /* PT0_15 */
#define LPI2C4_SDA_P0_15 A15X_MUX('0',15,3) /* PT0_15 */
#define CT_INP3_P0_15 A15X_MUX('0',15,4) /* PT0_15 */
#define UTICK_CAP1_P0_15 A15X_MUX('0',15,5) /* PT0_15 */
#define FLEXIO0_D7_P0_15 A15X_MUX('0',15,6) /* PT0_15 */
#define SMARTDMA_PIO5_P0_15 A15X_MUX('0',15,7) /* PT0_15 */
#define P0_16 A15X_MUX('0',16,0) /* PT0_16 */
#define WUU0_IN2_P0_16 A15X_MUX('0',16,0) /* PT0_16 */
#define EWM0_IN_P0_16 A15X_MUX('0',16,1) /* PT0_16 */
#define LPI2C0_SDA_P0_16 A15X_MUX('0',16,2) /* PT0_16 */
#define LPSPI0_PCS2_P0_16 A15X_MUX('0',16,3) /* PT0_16 */
#define CT0_MAT0_P0_16 A15X_MUX('0',16,4) /* PT0_16 */
#define UTICK_CAP2_P0_16 A15X_MUX('0',16,5) /* PT0_16 */
#define FLEXIO0_D0_P0_16 A15X_MUX('0',16,6) /* PT0_16 */
#define SMARTDMA_PIO6_P0_16 A15X_MUX('0',16,7) /* PT0_16 */
#define I3C0_SDA_P0_16 A15X_MUX('0',16,10) /* PT0_16 */
#define TSI0_CH4_P0_16 A15X_MUX('0',16,12) /* PT0_16 */
#define P0_17 A15X_MUX('0',17,0) /* PT0_17 */
#define EWM0_OUT_B_P0_17 A15X_MUX('0',17,1) /* PT0_17 */
#define LPI2C0_SCL_P0_17 A15X_MUX('0',17,2) /* PT0_17 */
#define LPSPI0_PCS3_P0_17 A15X_MUX('0',17,3) /* PT0_17 */
#define CT0_MAT1_P0_17 A15X_MUX('0',17,4) /* PT0_17 */
#define UTICK_CAP3_P0_17 A15X_MUX('0',17,5) /* PT0_17 */
#define FLEXIO0_D1_P0_17 A15X_MUX('0',17,6) /* PT0_17 */
#define SMARTDMA_PIO7_P0_17 A15X_MUX('0',17,7) /* PT0_17 */
#define I3C0_SCL_P0_17 A15X_MUX('0',17,10) /* PT0_17 */
#define TSI0_CH5_P0_17 A15X_MUX('0',17,12) /* PT0_17 */
#define P0_18 A15X_MUX('0',18,0) /* PT0_18 */
#define ADC0_A8_P0_18 A15X_MUX('0',18,0) /* PT0_18 */
#define EWM0_IN_P0_18 A15X_MUX('0',18,1) /* PT0_18 */
#define LPI2C0_SCLS_P0_18 A15X_MUX('0',18,2) /* PT0_18 */
#define CT0_MAT2_P0_18 A15X_MUX('0',18,4) /* PT0_18 */
#define FLEXIO0_D2_P0_18 A15X_MUX('0',18,6) /* PT0_18 */
#define SMARTDMA_PIO8_P0_18 A15X_MUX('0',18,7) /* PT0_18 */
#define CMP0_OUT_P0_18 A15X_MUX('0',18,8) /* PT0_18 */
#define TSI0_CH6_P0_18 A15X_MUX('0',18,12) /* PT0_18 */
#define WUU0_IN3_P0_19 A15X_MUX('0',19,0) /* PT0_19 */
#define ADC0_A9_P0_19 A15X_MUX('0',19,0) /* PT0_19 */
#define P0_19 A15X_MUX('0',19,0) /* PT0_19 */
#define EWM0_OUT_B_P0_19 A15X_MUX('0',19,1) /* PT0_19 */
#define LPI2C0_SDAS_P0_19 A15X_MUX('0',19,2) /* PT0_19 */
#define CT0_MAT3_P0_19 A15X_MUX('0',19,4) /* PT0_19 */
#define FLEXIO0_D3_P0_19 A15X_MUX('0',19,6) /* PT0_19 */
#define SMARTDMA_PIO9_P0_19 A15X_MUX('0',19,7) /* PT0_19 */
#define TSI0_CH7_P0_19 A15X_MUX('0',19,12) /* PT0_19 */
#define P0_20 A15X_MUX('0',20,0) /* PT0_20 */
#define WUU0_IN4_P0_20 A15X_MUX('0',20,0) /* PT0_20 */
#define LPI2C0_SDA_P0_20 A15X_MUX('0',20,2) /* PT0_20 */
#define LPUART0_RXD_P0_20 A15X_MUX('0',20,3) /* PT0_20 */
#define CT_INP0_P0_20 A15X_MUX('0',20,4) /* PT0_20 */
#define FLEXIO0_D4_P0_20 A15X_MUX('0',20,6) /* PT0_20 */
#define SMARTDMA_PIO10_P0_20 A15X_MUX('0',20,7) /* PT0_20 */
#define LPSPI4_SDO_P0_20 A15X_MUX('0',20,8) /* PT0_20 */
#define I3C0_SDA_P0_20 A15X_MUX('0',20,10) /* PT0_20 */
#define TSI0_CH8_P0_20 A15X_MUX('0',20,12) /* PT0_20 */
#define P0_21 A15X_MUX('0',21,0) /* PT0_21 */
#define LPI2C0_SCL_P0_21 A15X_MUX('0',21,2) /* PT0_21 */
#define LPUART0_TXD_P0_21 A15X_MUX('0',21,3) /* PT0_21 */
#define CT_INP1_P0_21 A15X_MUX('0',21,4) /* PT0_21 */
#define FLEXIO0_D5_P0_21 A15X_MUX('0',21,6) /* PT0_21 */
#define SMARTDMA_PIO11_P0_21 A15X_MUX('0',21,7) /* PT0_21 */
#define LPSPI4_SCK_P0_21 A15X_MUX('0',21,8) /* PT0_21 */
#define I3C0_SCL_P0_21 A15X_MUX('0',21,10) /* PT0_21 */
#define TSI0_CH9_P0_21 A15X_MUX('0',21,12) /* PT0_21 */
#define ADC0_A12_P0_22 A15X_MUX('0',22,0) /* PT0_22 */
#define P0_22 A15X_MUX('0',22,0) /* PT0_22 */
#define EWM0_IN_P0_22 A15X_MUX('0',22,1) /* PT0_22 */
#define LPI2C0_SCLS_P0_22 A15X_MUX('0',22,2) /* PT0_22 */
#define LPUART0_RTS_B_P0_22 A15X_MUX('0',22,3) /* PT0_22 */
#define CT_INP2_P0_22 A15X_MUX('0',22,4) /* PT0_22 */
#define CT0_MAT0_P0_22 A15X_MUX('0',22,5) /* PT0_22 */
#define FLEXIO0_D6_P0_22 A15X_MUX('0',22,6) /* PT0_22 */
#define SMARTDMA_PIO12_P0_22 A15X_MUX('0',22,7) /* PT0_22 */
#define LPSPI4_SDI_P0_22 A15X_MUX('0',22,8) /* PT0_22 */
#define I3C0_PUR_P0_22 A15X_MUX('0',22,10) /* PT0_22 */
#define TSI0_CH10_P0_22 A15X_MUX('0',22,12) /* PT0_22 */
#define WUU0_IN5_P0_23 A15X_MUX('0',23,0) /* PT0_23 */
#define P0_23 A15X_MUX('0',23,0) /* PT0_23 */
#define ADC0_A13_P0_23 A15X_MUX('0',23,0) /* PT0_23 */
#define EWM0_OUT_B_P0_23 A15X_MUX('0',23,1) /* PT0_23 */
#define LPI2C0_SDAS_P0_23 A15X_MUX('0',23,2) /* PT0_23 */
#define LPUART0_CTS_B_P0_23 A15X_MUX('0',23,3) /* PT0_23 */
#define CT_INP3_P0_23 A15X_MUX('0',23,4) /* PT0_23 */
#define CT0_MAT1_P0_23 A15X_MUX('0',23,5) /* PT0_23 */
#define FLEXIO0_D7_P0_23 A15X_MUX('0',23,6) /* PT0_23 */
#define SMARTDMA_PIO13_P0_23 A15X_MUX('0',23,7) /* PT0_23 */
#define LPSPI4_PCS0_P0_23 A15X_MUX('0',23,8) /* PT0_23 */
#define TSI0_CH11_P0_23 A15X_MUX('0',23,12) /* PT0_23 */
#define P0_24 A15X_MUX('0',24,0) /* PT0_24 */
#define CT0_MAT0_P0_24 A15X_MUX('0',24,4) /* PT0_24 */
#define LPUART5_RXD_P0_24 A15X_MUX('0',24,8) /* PT0_24 */
#define P0_25 A15X_MUX('0',25,0) /* PT0_25 */
#define CT0_MAT1_P0_25 A15X_MUX('0',25,4) /* PT0_25 */
#define LPUART5_TXD_P0_25 A15X_MUX('0',25,8) /* PT0_25 */
#define P0_26 A15X_MUX('0',26,0) /* PT0_26 */
#define CT0_MAT2_P0_26 A15X_MUX('0',26,4) /* PT0_26 */
#define LPUART5_RTS_B_P0_26 A15X_MUX('0',26,8) /* PT0_26 */
#define P0_27 A15X_MUX('0',27,0) /* PT0_27 */
#define CT0_MAT3_P0_27 A15X_MUX('0',27,4) /* PT0_27 */
#define LPUART5_CTS_B_P0_27 A15X_MUX('0',27,8) /* PT0_27 */
#define P1_0 A15X_MUX('1',0,0) /* PT1_0 */
#define LPTMR0_ALT3_P1_0 A15X_MUX('1',0,0) /* PT1_0 */
#define WUU0_IN6_P1_0 A15X_MUX('1',0,0) /* PT1_0 */
#define CMP0_IN0_P1_0 A15X_MUX('1',0,0) /* PT1_0 */
#define ADC0_A16_P1_0 A15X_MUX('1',0,0) /* PT1_0 */
#define TRIG_IN0_P1_0 A15X_MUX('1',0,1) /* PT1_0 */
#define LPSPI0_SDO_P1_0 A15X_MUX('1',0,2) /* PT1_0 */
#define LPI2C1_SDA_P1_0 A15X_MUX('1',0,3) /* PT1_0 */
#define CT_INP4_P1_0 A15X_MUX('1',0,4) /* PT1_0 */
#define TRIG_IN0/CT_INP4_P1_0_P1_0 A15X_MUX('1',0,4) /* PT1_0 */
#define CT0_MAT2_P1_0 A15X_MUX('1',0,5) /* PT1_0 */
#define FLEXIO0_D8_P1_0 A15X_MUX('1',0,6) /* PT1_0 */
#define TENBASET1S_RX_P1_0 A15X_MUX('1',0,10) /* PT1_0 */
#define CAN1_RXD_P1_0 A15X_MUX('1',0,11) /* PT1_0 */
#define TSI0_CH12_P1_0 A15X_MUX('1',0,12) /* PT1_0 */
#define P1_1 A15X_MUX('1',1,0) /* PT1_1 */
#define ADC0_A17_P1_1 A15X_MUX('1',1,0) /* PT1_1 */
#define TRIG_IN1_P1_1 A15X_MUX('1',1,1) /* PT1_1 */
#define LPSPI0_SCK_P1_1 A15X_MUX('1',1,2) /* PT1_1 */
#define LPI2C1_SCL_P1_1 A15X_MUX('1',1,3) /* PT1_1 */
#define TRIG_IN1/CT_INP5_P1_1_P1_1 A15X_MUX('1',1,4) /* PT1_1 */
#define CT_INP5_P1_1 A15X_MUX('1',1,4) /* PT1_1 */
#define CT0_MAT3_P1_1 A15X_MUX('1',1,5) /* PT1_1 */
#define FLEXIO0_D9_P1_1 A15X_MUX('1',1,6) /* PT1_1 */
#define TENBASET1S_ED_P1_1 A15X_MUX('1',1,10) /* PT1_1 */
#define CAN1_TXD_P1_1 A15X_MUX('1',1,11) /* PT1_1 */
#define TSI0_CH13_P1_1 A15X_MUX('1',1,12) /* PT1_1 */
#define ADC0_A18_P1_2 A15X_MUX('1',2,0) /* PT1_2 */
#define P1_2 A15X_MUX('1',2,0) /* PT1_2 */
#define TRIG_OUT0_P1_2 A15X_MUX('1',2,1) /* PT1_2 */
#define LPSPI0_SDI_P1_2 A15X_MUX('1',2,2) /* PT1_2 */
#define LPI2C1_SDAS_P1_2 A15X_MUX('1',2,3) /* PT1_2 */
#define CT1_MAT0_P1_2 A15X_MUX('1',2,4) /* PT1_2 */
#define CT_INP0_P1_2 A15X_MUX('1',2,5) /* PT1_2 */
#define FLEXIO0_D10_P1_2 A15X_MUX('1',2,6) /* PT1_2 */
#define ENET0_MDC_P1_2 A15X_MUX('1',2,9) /* PT1_2 */
#define TENBASET1S_TX_P1_2 A15X_MUX('1',2,10) /* PT1_2 */
#define CAN0_TXD_P1_2 A15X_MUX('1',2,11) /* PT1_2 */
#define TSI0_CH14_P1_2 A15X_MUX('1',2,12) /* PT1_2 */
#define CMP0_IN1_P1_3 A15X_MUX('1',3,0) /* PT1_3 */
#define WUU0_IN7_P1_3 A15X_MUX('1',3,0) /* PT1_3 */
#define ADC0_A19_P1_3 A15X_MUX('1',3,0) /* PT1_3 */
#define P1_3 A15X_MUX('1',3,0) /* PT1_3 */
#define TRIG_OUT1_P1_3 A15X_MUX('1',3,1) /* PT1_3 */
#define LPSPI0_PCS0_P1_3 A15X_MUX('1',3,2) /* PT1_3 */
#define LPI2C1_SCLS_P1_3 A15X_MUX('1',3,3) /* PT1_3 */
#define CT1_MAT1_P1_3 A15X_MUX('1',3,4) /* PT1_3 */
#define CT_INP1_P1_3 A15X_MUX('1',3,5) /* PT1_3 */
#define FLEXIO0_D11_P1_3 A15X_MUX('1',3,6) /* PT1_3 */
#define ENET0_MDIO_P1_3 A15X_MUX('1',3,9) /* PT1_3 */
#define CAN0_RXD_P1_3 A15X_MUX('1',3,11) /* PT1_3 */
#define TSI0_CH15_P1_3 A15X_MUX('1',3,12) /* PT1_3 */
#define WUU0_IN8_P1_4 A15X_MUX('1',4,0) /* PT1_4 */
#define CMP0_IN2_P1_4 A15X_MUX('1',4,0) /* PT1_4 */
#define ADC0_A20_P1_4 A15X_MUX('1',4,0) /* PT1_4 */
#define P1_4 A15X_MUX('1',4,0) /* PT1_4 */
#define FREQME_CLK_IN0_P1_4 A15X_MUX('1',4,1) /* PT1_4 */
#define LPSPI0_PCS3_P1_4 A15X_MUX('1',4,2) /* PT1_4 */
#define LPUART2_RXD_P1_4 A15X_MUX('1',4,3) /* PT1_4 */
#define CT1_MAT2_P1_4 A15X_MUX('1',4,4) /* PT1_4 */
#define FLEXIO0_D12_P1_4 A15X_MUX('1',4,6) /* PT1_4 */
#define SMARTDMA_PIO0_P1_4 A15X_MUX('1',4,7) /* PT1_4 */
#define LPI2C4_SDAS_P1_4 A15X_MUX('1',4,8) /* PT1_4 */
#define ENET0_TX_CLK_P1_4 A15X_MUX('1',4,9) /* PT1_4 */
#define TSI0_CH16_P1_4 A15X_MUX('1',4,12) /* PT1_4 */
#define P1_5 A15X_MUX('1',5,0) /* PT1_5 */
#define CMP0_IN3_P1_5 A15X_MUX('1',5,0) /* PT1_5 */
#define ADC0_A21_P1_5 A15X_MUX('1',5,0) /* PT1_5 */
#define FREQME_CLK_IN1_P1_5 A15X_MUX('1',5,1) /* PT1_5 */
#define LPSPI0_PCS2_P1_5 A15X_MUX('1',5,2) /* PT1_5 */
#define LPUART2_TXD_P1_5 A15X_MUX('1',5,3) /* PT1_5 */
#define CT1_MAT3_P1_5 A15X_MUX('1',5,4) /* PT1_5 */
#define FLEXIO0_D13_P1_5 A15X_MUX('1',5,6) /* PT1_5 */
#define SMARTDMA_PIO1_P1_5 A15X_MUX('1',5,7) /* PT1_5 */
#define LPI2C4_SCLS_P1_5 A15X_MUX('1',5,8) /* PT1_5 */
#define ENET0_TXEN_P1_5 A15X_MUX('1',5,9) /* PT1_5 */
#define I3C1_SDA3_P1_5 A15X_MUX('1',5,10) /* PT1_5 */
#define TSI0_CH17_P1_5 A15X_MUX('1',5,12) /* PT1_5 */
#define ADC0_A22_P1_6 A15X_MUX('1',6,0) /* PT1_6 */
#define P1_6 A15X_MUX('1',6,0) /* PT1_6 */
#define TRIG_IN2_P1_6 A15X_MUX('1',6,1) /* PT1_6 */
#define LPSPI0_PCS1_P1_6 A15X_MUX('1',6,2) /* PT1_6 */
#define LPUART2_RTS_B_P1_6 A15X_MUX('1',6,3) /* PT1_6 */
#define CT_INP6_P1_6 A15X_MUX('1',6,4) /* PT1_6 */
#define TRIG_IN2/CT_INP6_P1_6_P1_6 A15X_MUX('1',6,4) /* PT1_6 */
#define CT4_MAT0_P1_6 A15X_MUX('1',6,5) /* PT1_6 */
#define FLEXIO0_D14_P1_6 A15X_MUX('1',6,6) /* PT1_6 */
#define SMARTDMA_PIO2_P1_6 A15X_MUX('1',6,7) /* PT1_6 */
#define LPI2C4_SCL_P1_6 A15X_MUX('1',6,8) /* PT1_6 */
#define ENET0_TXD0_P1_6 A15X_MUX('1',6,9) /* PT1_6 */
#define I3C1_SDA2_P1_6 A15X_MUX('1',6,10) /* PT1_6 */
#define CAN1_TXD_P1_6 A15X_MUX('1',6,11) /* PT1_6 */
#define TSI0_CH18_P1_6 A15X_MUX('1',6,12) /* PT1_6 */
#define ADC0_A23_P1_7 A15X_MUX('1',7,0) /* PT1_7 */
#define P1_7 A15X_MUX('1',7,0) /* PT1_7 */
#define WUU0_IN9_P1_7 A15X_MUX('1',7,0) /* PT1_7 */
#define TRIG_OUT2_P1_7 A15X_MUX('1',7,1) /* PT1_7 */
#define LPUART2_CTS_B_P1_7 A15X_MUX('1',7,3) /* PT1_7 */
#define CT_INP7_P1_7 A15X_MUX('1',7,4) /* PT1_7 */
#define CT4_MAT1_P1_7 A15X_MUX('1',7,5) /* PT1_7 */
#define FLEXIO0_D15_P1_7 A15X_MUX('1',7,6) /* PT1_7 */
#define SMARTDMA_PIO3_P1_7 A15X_MUX('1',7,7) /* PT1_7 */
#define LPI2C4_SDA_P1_7 A15X_MUX('1',7,8) /* PT1_7 */
#define ENET0_TXD1_P1_7 A15X_MUX('1',7,9) /* PT1_7 */
#define I3C1_SDA1_P1_7 A15X_MUX('1',7,10) /* PT1_7 */
#define CAN1_RXD_P1_7 A15X_MUX('1',7,11) /* PT1_7 */
#define TSI0_CH19_P1_7 A15X_MUX('1',7,12) /* PT1_7 */
#define P1_8 A15X_MUX('1',8,0) /* PT1_8 */
#define WUU0_IN10_P1_8 A15X_MUX('1',8,0) /* PT1_8 */
#define FREQME_CLK_IN0_P1_8 A15X_MUX('1',8,1) /* PT1_8 */
#define LPUART1_RXD_P1_8 A15X_MUX('1',8,2) /* PT1_8 */
#define LPI2C2_SDA_P1_8 A15X_MUX('1',8,3) /* PT1_8 */
#define CT_INP8_P1_8 A15X_MUX('1',8,4) /* PT1_8 */
#define CT0_MAT2_P1_8 A15X_MUX('1',8,5) /* PT1_8 */
#define FLEXIO0_D16_P1_8 A15X_MUX('1',8,6) /* PT1_8 */
#define SMARTDMA_PIO4_P1_8 A15X_MUX('1',8,7) /* PT1_8 */
#define ENET0_TXD2_P1_8 A15X_MUX('1',8,9) /* PT1_8 */
#define I3C1_SDA_P1_8 A15X_MUX('1',8,10) /* PT1_8 */
#define P1_9 A15X_MUX('1',9,0) /* PT1_9 */
#define FREQME_CLK_IN1_P1_9 A15X_MUX('1',9,1) /* PT1_9 */
#define LPUART1_TXD_P1_9 A15X_MUX('1',9,2) /* PT1_9 */
#define LPI2C2_SCL_P1_9 A15X_MUX('1',9,3) /* PT1_9 */
#define CT_INP9_P1_9 A15X_MUX('1',9,4) /* PT1_9 */
#define CT0_MAT3_P1_9 A15X_MUX('1',9,5) /* PT1_9 */
#define FLEXIO0_D17_P1_9 A15X_MUX('1',9,6) /* PT1_9 */
#define SMARTDMA_PIO5_P1_9 A15X_MUX('1',9,7) /* PT1_9 */
#define ENET0_TXD3_P1_9 A15X_MUX('1',9,9) /* PT1_9 */
#define I3C1_SCL_P1_9 A15X_MUX('1',9,10) /* PT1_9 */
#define P1_10 A15X_MUX('1',10,0) /* PT1_10 */
#define ADC1_A8_P1_10 A15X_MUX('1',10,0) /* PT1_10 */
#define LPUART1_RTS_B_P1_10 A15X_MUX('1',10,2) /* PT1_10 */
#define LPI2C2_SDAS_P1_10 A15X_MUX('1',10,3) /* PT1_10 */
#define CT2_MAT0_P1_10 A15X_MUX('1',10,4) /* PT1_10 */
#define FLEXIO0_D18_P1_10 A15X_MUX('1',10,6) /* PT1_10 */
#define SMARTDMA_PIO6_P1_10 A15X_MUX('1',10,7) /* PT1_10 */
#define LPUART5_TXD_P1_10 A15X_MUX('1',10,8) /* PT1_10 */
#define CAN0_TXD_P1_10 A15X_MUX('1',10,11) /* PT1_10 */
#define TSI0_CH20_P1_10 A15X_MUX('1',10,12) /* PT1_10 */
#define P1_11 A15X_MUX('1',11,0) /* PT1_11 */
#define ADC1_A9_P1_11 A15X_MUX('1',11,0) /* PT1_11 */
#define WUU0_IN11_P1_11 A15X_MUX('1',11,0) /* PT1_11 */
#define TRIG_OUT2_P1_11 A15X_MUX('1',11,1) /* PT1_11 */
#define LPUART1_CTS_B_P1_11 A15X_MUX('1',11,2) /* PT1_11 */
#define LPI2C2_SCLS_P1_11 A15X_MUX('1',11,3) /* PT1_11 */
#define CT2_MAT1_P1_11 A15X_MUX('1',11,4) /* PT1_11 */
#define FLEXIO0_D19_P1_11 A15X_MUX('1',11,6) /* PT1_11 */
#define SMARTDMA_PIO7_P1_11 A15X_MUX('1',11,7) /* PT1_11 */
#define LPUART5_RXD_P1_11 A15X_MUX('1',11,8) /* PT1_11 */
#define ENET0_RXD0_P1_11 A15X_MUX('1',11,9) /* PT1_11 */
#define TENBASET1S_RX_P1_11 A15X_MUX('1',11,10) /* PT1_11 */
#define CAN0_RXD_P1_11 A15X_MUX('1',11,11) /* PT1_11 */
#define TSI0_CH21_P1_11 A15X_MUX('1',11,12) /* PT1_11 */
#define ADC1_A10_P1_12 A15X_MUX('1',12,0) /* PT1_12 */
#define WUU0_IN12_P1_12 A15X_MUX('1',12,0) /* PT1_12 */
#define P1_12 A15X_MUX('1',12,0) /* PT1_12 */
#define LPI2C1_SDA_P1_12 A15X_MUX('1',12,2) /* PT1_12 */
#define LPUART2_RXD_P1_12 A15X_MUX('1',12,3) /* PT1_12 */
#define CT2_MAT2_P1_12 A15X_MUX('1',12,4) /* PT1_12 */
#define LPSPI5_SDO_P1_12 A15X_MUX('1',12,5) /* PT1_12 */
#define FLEXIO0_D20_P1_12 A15X_MUX('1',12,6) /* PT1_12 */
#define SMARTDMA_PIO8_P1_12 A15X_MUX('1',12,7) /* PT1_12 */
#define LPUART5_CTS_B_P1_12 A15X_MUX('1',12,8) /* PT1_12 */
#define ENET0_RXD1_P1_12 A15X_MUX('1',12,9) /* PT1_12 */
#define TENBASET1S_ED_P1_12 A15X_MUX('1',12,10) /* PT1_12 */
#define CAN1_RXD_P1_12 A15X_MUX('1',12,11) /* PT1_12 */
#define TSI0_CH22_P1_12 A15X_MUX('1',12,12) /* PT1_12 */
#define ADC1_A11_P1_13 A15X_MUX('1',13,0) /* PT1_13 */
#define P1_13 A15X_MUX('1',13,0) /* PT1_13 */
#define TRIG_IN3_P1_13 A15X_MUX('1',13,1) /* PT1_13 */
#define LPI2C1_SCL_P1_13 A15X_MUX('1',13,2) /* PT1_13 */
#define LPUART2_TXD_P1_13 A15X_MUX('1',13,3) /* PT1_13 */
#define CT2_MAT3_P1_13 A15X_MUX('1',13,4) /* PT1_13 */
#define LPSPI5_SCK_P1_13 A15X_MUX('1',13,5) /* PT1_13 */
#define FLEXIO0_D21_P1_13 A15X_MUX('1',13,6) /* PT1_13 */
#define SMARTDMA_PIO9_P1_13 A15X_MUX('1',13,7) /* PT1_13 */
#define LPUART5_RTS_B_P1_13 A15X_MUX('1',13,8) /* PT1_13 */
#define ENET0_RXDV_P1_13 A15X_MUX('1',13,9) /* PT1_13 */
#define TENBASET1S_TX_P1_13 A15X_MUX('1',13,10) /* PT1_13 */
#define CAN1_TXD_P1_13 A15X_MUX('1',13,11) /* PT1_13 */
#define TSI0_CH23_P1_13 A15X_MUX('1',13,12) /* PT1_13 */
#define P1_14 A15X_MUX('1',14,0) /* PT1_14 */
#define ADC1_A12_P1_14 A15X_MUX('1',14,0) /* PT1_14 */
#define LPI2C1_SCLS_P1_14 A15X_MUX('1',14,2) /* PT1_14 */
#define LPUART2_RTS_B_P1_14 A15X_MUX('1',14,3) /* PT1_14 */
#define CT_INP10_P1_14 A15X_MUX('1',14,4) /* PT1_14 */
#define CT3_MAT0_P1_14 A15X_MUX('1',14,5) /* PT1_14 */
#define FLEXIO0_D22_P1_14 A15X_MUX('1',14,6) /* PT1_14 */
#define SMARTDMA_PIO10_P1_14 A15X_MUX('1',14,7) /* PT1_14 */
#define LPSPI5_SDI_P1_14 A15X_MUX('1',14,8) /* PT1_14 */
#define ENET0_RX_CLK_P1_14 A15X_MUX('1',14,9) /* PT1_14 */
#define I3C1_SDA1_P1_14 A15X_MUX('1',14,10) /* PT1_14 */
#define TSI0_CH24_P1_14 A15X_MUX('1',14,12) /* PT1_14 */
#define WUU0_IN13_P1_15 A15X_MUX('1',15,0) /* PT1_15 */
#define ADC1_A13_P1_15 A15X_MUX('1',15,0) /* PT1_15 */
#define P1_15 A15X_MUX('1',15,0) /* PT1_15 */
#define LPI2C1_SDAS_P1_15 A15X_MUX('1',15,2) /* PT1_15 */
#define LPUART2_CTS_B_P1_15 A15X_MUX('1',15,3) /* PT1_15 */
#define CT_INP11_P1_15 A15X_MUX('1',15,4) /* PT1_15 */
#define CT3_MAT1_P1_15 A15X_MUX('1',15,5) /* PT1_15 */
#define FLEXIO0_D23_P1_15 A15X_MUX('1',15,6) /* PT1_15 */
#define SMARTDMA_PIO11_P1_15 A15X_MUX('1',15,7) /* PT1_15 */
#define LPSPI5_PCS0_P1_15 A15X_MUX('1',15,8) /* PT1_15 */
#define ENET0_RXER_P1_15 A15X_MUX('1',15,9) /* PT1_15 */
#define I3C1_PUR_P1_15 A15X_MUX('1',15,10) /* PT1_15 */
#define TSI0_CH25_P1_15 A15X_MUX('1',15,12) /* PT1_15 */
#define ADC1_A14_P1_16 A15X_MUX('1',16,0) /* PT1_16 */
#define WUU0_IN14_P1_16 A15X_MUX('1',16,0) /* PT1_16 */
#define P1_16 A15X_MUX('1',16,0) /* PT1_16 */
#define LPI2C4_SDAS_P1_16 A15X_MUX('1',16,3) /* PT1_16 */
#define CT_INP12_P1_16 A15X_MUX('1',16,4) /* PT1_16 */
#define LPSPI5_PCS3_P1_16 A15X_MUX('1',16,5) /* PT1_16 */
#define FLEXIO0_D24_P1_16 A15X_MUX('1',16,6) /* PT1_16 */
#define SMARTDMA_PIO12_P1_16 A15X_MUX('1',16,7) /* PT1_16 */
#define LPUART5_RXD_P1_16 A15X_MUX('1',16,8) /* PT1_16 */
#define ENET0_RXD2_P1_16 A15X_MUX('1',16,9) /* PT1_16 */
#define I3C1_SDA_P1_16 A15X_MUX('1',16,10) /* PT1_16 */
#define CAN1_RXD_P1_16 A15X_MUX('1',16,11) /* PT1_16 */
#define TSI0_CH26_P1_16 A15X_MUX('1',16,12) /* PT1_16 */
#define P1_17 A15X_MUX('1',17,0) /* PT1_17 */
#define ADC1_A15_P1_17 A15X_MUX('1',17,0) /* PT1_17 */
#define LPI2C4_SCLS_P1_17 A15X_MUX('1',17,3) /* PT1_17 */
#define CT_INP13_P1_17 A15X_MUX('1',17,4) /* PT1_17 */
#define LPSPI5_PCS2_P1_17 A15X_MUX('1',17,5) /* PT1_17 */
#define FLEXIO0_D25_P1_17 A15X_MUX('1',17,6) /* PT1_17 */
#define SMARTDMA_PIO13_P1_17 A15X_MUX('1',17,7) /* PT1_17 */
#define LPUART5_TXD_P1_17 A15X_MUX('1',17,8) /* PT1_17 */
#define ENET0_RXD3_P1_17 A15X_MUX('1',17,9) /* PT1_17 */
#define I3C1_SCL_P1_17 A15X_MUX('1',17,10) /* PT1_17 */
#define CAN1_TXD_P1_17 A15X_MUX('1',17,11) /* PT1_17 */
#define TSI0_CH27_P1_17 A15X_MUX('1',17,12) /* PT1_17 */
#define ADC1_A16_P1_18 A15X_MUX('1',18,0) /* PT1_18 */
#define P1_18 A15X_MUX('1',18,0) /* PT1_18 */
#define FREQME_CLK_IN0_P1_18 A15X_MUX('1',18,1) /* PT1_18 */
#define LPI2C4_SCL_P1_18 A15X_MUX('1',18,3) /* PT1_18 */
#define CT3_MAT0_P1_18 A15X_MUX('1',18,4) /* PT1_18 */
#define LPSPI5_PCS1_P1_18 A15X_MUX('1',18,5) /* PT1_18 */
#define FLEXIO0_D26_P1_18 A15X_MUX('1',18,6) /* PT1_18 */
#define SMARTDMA_PIO14_P1_18 A15X_MUX('1',18,7) /* PT1_18 */
#define LPUART5_RTS_B_P1_18 A15X_MUX('1',18,8) /* PT1_18 */
#define ENET0_COL_P1_18 A15X_MUX('1',18,9) /* PT1_18 */
#define I3C1_SDA3_P1_18 A15X_MUX('1',18,10) /* PT1_18 */
#define CAN0_TXD_P1_18 A15X_MUX('1',18,11) /* PT1_18 */
#define TSI0_CH28_P1_18 A15X_MUX('1',18,12) /* PT1_18 */
#define WUU0_IN15_P1_19 A15X_MUX('1',19,0) /* PT1_19 */
#define ADC1_A17_P1_19 A15X_MUX('1',19,0) /* PT1_19 */
#define P1_19 A15X_MUX('1',19,0) /* PT1_19 */
