zephyrproject-rtos/hal_nxp/dts/nxp/mcx/mcxa/pinctrl/MCXA577VPN-pinctrl.h
#define FREQME_CLK_IN1_P1_19 A15X_MUX('1',19,1) /* PT1_19 */
#define LPI2C4_SDA_P1_19 A15X_MUX('1',19,3) /* PT1_19 */
#define CT3_MAT1_P1_19 A15X_MUX('1',19,4) /* PT1_19 */
#define FLEXIO0_D27_P1_19 A15X_MUX('1',19,6) /* PT1_19 */
#define SMARTDMA_PIO15_P1_19 A15X_MUX('1',19,7) /* PT1_19 */
#define LPUART5_CTS_B_P1_19 A15X_MUX('1',19,8) /* PT1_19 */
#define ENET0_CRS_P1_19 A15X_MUX('1',19,9) /* PT1_19 */
#define I3C1_SDA2_P1_19 A15X_MUX('1',19,10) /* PT1_19 */
#define CAN0_RXD_P1_19 A15X_MUX('1',19,11) /* PT1_19 */
#define TSI0_CH29_P1_19 A15X_MUX('1',19,12) /* PT1_19 */
#define P1_29 A15X_MUX('1',29,0) /* PT1_29 */
#define RESET_B_P1_29 A15X_MUX('1',29,1) /* PT1_29 */
#define SPC_LPREQ_P1_29 A15X_MUX('1',29,2) /* PT1_29 */
#define XTAL48M_P1_30 A15X_MUX('1',30,0) /* PT1_30 */
#define P1_30 A15X_MUX('1',30,0) /* PT1_30 */
#define TRIG_OUT3_P1_30 A15X_MUX('1',30,1) /* PT1_30 */
#define LPI2C0_SDA_P1_30 A15X_MUX('1',30,3) /* PT1_30 */
#define CT_INP16_P1_30 A15X_MUX('1',30,4) /* PT1_30 */
#define FLEXIO0_D30_P1_30 A15X_MUX('1',30,6) /* PT1_30 */
#define I3C2_SDA_P1_30 A15X_MUX('1',30,10) /* PT1_30 */
#define P1_31 A15X_MUX('1',31,0) /* PT1_31 */
#define EXTAL48M_P1_31 A15X_MUX('1',31,0) /* PT1_31 */
#define TRIG_IN4_P1_31 A15X_MUX('1',31,1) /* PT1_31 */
#define LPI2C0_SCL_P1_31 A15X_MUX('1',31,3) /* PT1_31 */
#define TRIG_IN4/CT_INP17_P1_31_P1_31 A15X_MUX('1',31,4) /* PT1_31 */
#define CT_INP17_P1_31 A15X_MUX('1',31,4) /* PT1_31 */
#define FLEXIO0_D31_P1_31 A15X_MUX('1',31,6) /* PT1_31 */
#define I3C2_SCL_P1_31 A15X_MUX('1',31,10) /* PT1_31 */
#define WUU0_IN18_P2_0 A15X_MUX('2',0,0) /* PT2_0 */
#define ADC0_A0_P2_0 A15X_MUX('2',0,0) /* PT2_0 */
#define P2_0 A15X_MUX('2',0,0) /* PT2_0 */
#define TRIG_IN6_P2_0 A15X_MUX('2',0,1) /* PT2_0 */
#define LPUART0_RXD_P2_0 A15X_MUX('2',0,2) /* PT2_0 */
#define LPUART4_CTS_B_P2_0 A15X_MUX('2',0,3) /* PT2_0 */
#define CT_INP16_P2_0 A15X_MUX('2',0,4) /* PT2_0 */
#define TRIG_IN6/CT_INP16_P2_0_P2_0 A15X_MUX('2',0,4) /* PT2_0 */
#define CT2_MAT0_P2_0 A15X_MUX('2',0,5) /* PT2_0 */
#define FLEXIO0_D8_P2_0 A15X_MUX('2',0,6) /* PT2_0 */
#define SMARTDMA_PIO24_P2_0 A15X_MUX('2',0,7) /* PT2_0 */
#define LPSPI2_SDO_P2_0 A15X_MUX('2',0,8) /* PT2_0 */
#define CAN1_RXD_P2_0 A15X_MUX('2',0,11) /* PT2_0 */
#define TSI0_CH30_P2_0 A15X_MUX('2',0,12) /* PT2_0 */
#define P2_1 A15X_MUX('2',1,0) /* PT2_1 */
#define ADC1_A0_P2_1 A15X_MUX('2',1,0) /* PT2_1 */
#define TRIG_IN7_P2_1 A15X_MUX('2',1,1) /* PT2_1 */
#define LPUART0_TXD_P2_1 A15X_MUX('2',1,2) /* PT2_1 */
#define LPUART4_RTS_B_P2_1 A15X_MUX('2',1,3) /* PT2_1 */
#define CT_INP17_P2_1 A15X_MUX('2',1,4) /* PT2_1 */
#define TRIG_IN7/CT_INP17_P2_1_P2_1 A15X_MUX('2',1,4) /* PT2_1 */
#define CT2_MAT1_P2_1 A15X_MUX('2',1,5) /* PT2_1 */
#define FLEXIO0_D9_P2_1 A15X_MUX('2',1,6) /* PT2_1 */
#define SMARTDMA_PIO25_P2_1 A15X_MUX('2',1,7) /* PT2_1 */
#define LPSPI2_SCK_P2_1 A15X_MUX('2',1,8) /* PT2_1 */
#define CAN1_TXD_P2_1 A15X_MUX('2',1,11) /* PT2_1 */
#define TSI0_CH31_P2_1 A15X_MUX('2',1,12) /* PT2_1 */
#define ADC0_A4_P2_2 A15X_MUX('2',2,0) /* PT2_2 */
#define P2_2 A15X_MUX('2',2,0) /* PT2_2 */
#define DAC0_OUT_P2_2 A15X_MUX('2',2,0) /* PT2_2 */
#define CMP0_INN4_P2_2 A15X_MUX('2',2,0) /* PT2_2 */
#define TRIG_IN6_P2_2 A15X_MUX('2',2,1) /* PT2_2 */
#define LPUART0_RTS_B_P2_2 A15X_MUX('2',2,2) /* PT2_2 */
#define LPUART2_TXD_P2_2 A15X_MUX('2',2,3) /* PT2_2 */
#define CT_INP12_P2_2 A15X_MUX('2',2,4) /* PT2_2 */
#define TRIG_IN6/CT_INP12_P2_2_P2_2 A15X_MUX('2',2,4) /* PT2_2 */
#define CT2_MAT2_P2_2 A15X_MUX('2',2,5) /* PT2_2 */
#define FLEXIO0_D10_P2_2 A15X_MUX('2',2,6) /* PT2_2 */
#define SMARTDMA_PIO26_P2_2 A15X_MUX('2',2,7) /* PT2_2 */
#define LPSPI2_SDI_P2_2 A15X_MUX('2',2,8) /* PT2_2 */
#define TSI0_CH32_P2_2 A15X_MUX('2',2,12) /* PT2_2 */
#define ADC1_A4_P2_3 A15X_MUX('2',3,0) /* PT2_3 */
#define P2_3 A15X_MUX('2',3,0) /* PT2_3 */
#define CMP0_INN5_P2_3 A15X_MUX('2',3,0) /* PT2_3 */
#define DAC1_OUT_P2_3 A15X_MUX('2',3,0) /* PT2_3 */
#define ADC0_A3_P2_3 A15X_MUX('2',3,0) /* PT2_3 */
#define WUU0_IN19_P2_3 A15X_MUX('2',3,0) /* PT2_3 */
#define TRIG_IN7_P2_3 A15X_MUX('2',3,1) /* PT2_3 */
#define LPUART0_CTS_B_P2_3 A15X_MUX('2',3,2) /* PT2_3 */
#define LPUART2_RXD_P2_3 A15X_MUX('2',3,3) /* PT2_3 */
#define CT_INP13_P2_3 A15X_MUX('2',3,4) /* PT2_3 */
#define TRIG_IN7/CT_INP13_P2_3_P2_3 A15X_MUX('2',3,4) /* PT2_3 */
#define CT2_MAT3_P2_3 A15X_MUX('2',3,5) /* PT2_3 */
#define FLEXIO0_D11_P2_3 A15X_MUX('2',3,6) /* PT2_3 */
#define SMARTDMA_PIO27_P2_3 A15X_MUX('2',3,7) /* PT2_3 */
#define LPSPI2_PCS0_P2_3 A15X_MUX('2',3,8) /* PT2_3 */
#define TSI0_CH33_P2_3 A15X_MUX('2',3,12) /* PT2_3 */
#define ADC0_A1_P2_4 A15X_MUX('2',4,0) /* PT2_4 */
#define P2_4 A15X_MUX('2',4,0) /* PT2_4 */
#define LPUART2_CTS_B_P2_4 A15X_MUX('2',4,3) /* PT2_4 */
#define CT_INP14_P2_4 A15X_MUX('2',4,4) /* PT2_4 */
#define CT1_MAT0_P2_4 A15X_MUX('2',4,5) /* PT2_4 */
#define FLEXIO0_D12_P2_4 A15X_MUX('2',4,6) /* PT2_4 */
#define SMARTDMA_PIO28_P2_4 A15X_MUX('2',4,7) /* PT2_4 */
#define LPSPI2_PCS3_P2_4 A15X_MUX('2',4,8) /* PT2_4 */
#define TSI0_CH34_P2_4 A15X_MUX('2',4,12) /* PT2_4 */
#define ADC1_A1_P2_5 A15X_MUX('2',5,0) /* PT2_5 */
#define P2_5 A15X_MUX('2',5,0) /* PT2_5 */
#define LPUART2_RTS_B_P2_5 A15X_MUX('2',5,3) /* PT2_5 */
#define CT_INP15_P2_5 A15X_MUX('2',5,4) /* PT2_5 */
#define CT1_MAT1_P2_5 A15X_MUX('2',5,5) /* PT2_5 */
#define FLEXIO0_D13_P2_5 A15X_MUX('2',5,6) /* PT2_5 */
#define SMARTDMA_PIO29_P2_5 A15X_MUX('2',5,7) /* PT2_5 */
#define LPSPI2_PCS2_P2_5 A15X_MUX('2',5,8) /* PT2_5 */
#define TSI0_CH35_P2_5 A15X_MUX('2',5,12) /* PT2_5 */
#define P2_6 A15X_MUX('2',6,0) /* PT2_6 */
#define ADC1_A3_P2_6 A15X_MUX('2',6,0) /* PT2_6 */
#define TRIG_OUT4_P2_6 A15X_MUX('2',6,1) /* PT2_6 */
#define LPSPI1_PCS1_P2_6 A15X_MUX('2',6,2) /* PT2_6 */
#define LPUART4_RXD_P2_6 A15X_MUX('2',6,3) /* PT2_6 */
#define CT_INP18_P2_6 A15X_MUX('2',6,4) /* PT2_6 */
#define CT1_MAT2_P2_6 A15X_MUX('2',6,5) /* PT2_6 */
#define FLEXIO0_D14_P2_6 A15X_MUX('2',6,6) /* PT2_6 */
#define SMARTDMA_PIO30_P2_6 A15X_MUX('2',6,7) /* PT2_6 */
#define LPSPI2_PCS1_P2_6 A15X_MUX('2',6,8) /* PT2_6 */
#define TSI0_CH36_P2_6 A15X_MUX('2',6,12) /* PT2_6 */
#define ADC1_A7_P2_7 A15X_MUX('2',7,0) /* PT2_7 */
#define P2_7 A15X_MUX('2',7,0) /* PT2_7 */
#define ADC0_A7_P2_7 A15X_MUX('2',7,0) /* PT2_7 */
#define VREFO_P2_7 A15X_MUX('2',7,0) /* PT2_7 */
#define VREFI_P2_7 A15X_MUX('2',7,0) /* PT2_7 */
#define TRIG_IN5_P2_7 A15X_MUX('2',7,1) /* PT2_7 */
#define LPUART4_TXD_P2_7 A15X_MUX('2',7,3) /* PT2_7 */
#define CT_INP19_P2_7 A15X_MUX('2',7,4) /* PT2_7 */
#define TRIG_IN5/CT_INP19_P2_7_P2_7 A15X_MUX('2',7,4) /* PT2_7 */
#define CT1_MAT3_P2_7 A15X_MUX('2',7,5) /* PT2_7 */
#define FLEXIO0_D15_P2_7 A15X_MUX('2',7,6) /* PT2_7 */
#define SMARTDMA_PIO31_P2_7 A15X_MUX('2',7,7) /* PT2_7 */
#define TSI0_CH37_P2_7 A15X_MUX('2',7,12) /* PT2_7 */
#define P2_8 A15X_MUX('2',8,0) /* PT2_8 */
#define TRIG_OUT3_P2_8 A15X_MUX('2',8,1) /* PT2_8 */
#define CT3_MAT0_P2_8 A15X_MUX('2',8,4) /* PT2_8 */
#define FLEXIO0_D16_P2_8 A15X_MUX('2',8,6) /* PT2_8 */
#define P2_9 A15X_MUX('2',9,0) /* PT2_9 */
#define TRIG_IN4_P2_9 A15X_MUX('2',9,1) /* PT2_9 */
#define CT3_MAT1_P2_9 A15X_MUX('2',9,4) /* PT2_9 */
#define FLEXIO0_D17_P2_9 A15X_MUX('2',9,6) /* PT2_9 */
#define P2_10 A15X_MUX('2',10,0) /* PT2_10 */
#define TRIG_OUT5_P2_10 A15X_MUX('2',10,1) /* PT2_10 */
#define LPUART2_TXD_P2_10 A15X_MUX('2',10,3) /* PT2_10 */
#define CT3_MAT2_P2_10 A15X_MUX('2',10,4) /* PT2_10 */
#define FLEXIO0_D18_P2_10 A15X_MUX('2',10,6) /* PT2_10 */
#define SMARTDMA_PIO14_P2_10 A15X_MUX('2',10,7) /* PT2_10 */
#define P2_11 A15X_MUX('2',11,0) /* PT2_11 */
#define TRIG_IN4_P2_11 A15X_MUX('2',11,1) /* PT2_11 */
#define LPUART2_RXD_P2_11 A15X_MUX('2',11,3) /* PT2_11 */
#define CT3_MAT3_P2_11 A15X_MUX('2',11,4) /* PT2_11 */
#define FLEXIO0_D19_P2_11 A15X_MUX('2',11,6) /* PT2_11 */
#define SMARTDMA_PIO15_P2_11 A15X_MUX('2',11,7) /* PT2_11 */
#define P2_12 A15X_MUX('2',12,0) /* PT2_12 */
#define ADC0_A5_P2_12 A15X_MUX('2',12,0) /* PT2_12 */
#define WUU0_IN20_P2_12 A15X_MUX('2',12,0) /* PT2_12 */
#define USB1_VBUSVALID_EXT_P2_12 A15X_MUX('2',12,1) /* PT2_12 */
#define LPSPI1_SCK_P2_12 A15X_MUX('2',12,2) /* PT2_12 */
#define LPUART1_RXD_P2_12 A15X_MUX('2',12,3) /* PT2_12 */
#define CT4_MAT0_P2_12 A15X_MUX('2',12,4) /* PT2_12 */
#define CT0_MAT0_P2_12 A15X_MUX('2',12,5) /* PT2_12 */
#define FLEXIO0_D20_P2_12 A15X_MUX('2',12,6) /* PT2_12 */
#define SMARTDMA_PIO16_P2_12 A15X_MUX('2',12,7) /* PT2_12 */
#define CAN0_RXD_P2_12 A15X_MUX('2',12,11) /* PT2_12 */
#define TSI0_CH38_P2_12 A15X_MUX('2',12,12) /* PT2_12 */
#define P2_13 A15X_MUX('2',13,0) /* PT2_13 */
#define ADC1_A5_P2_13 A15X_MUX('2',13,0) /* PT2_13 */
#define TRIG_IN8_P2_13 A15X_MUX('2',13,1) /* PT2_13 */
#define LPSPI1_SDO_P2_13 A15X_MUX('2',13,2) /* PT2_13 */
#define LPUART1_TXD_P2_13 A15X_MUX('2',13,3) /* PT2_13 */
#define CT4_MAT1_P2_13 A15X_MUX('2',13,4) /* PT2_13 */
#define CT0_MAT1_P2_13 A15X_MUX('2',13,5) /* PT2_13 */
#define FLEXIO0_D21_P2_13 A15X_MUX('2',13,6) /* PT2_13 */
#define SMARTDMA_PIO17_P2_13 A15X_MUX('2',13,7) /* PT2_13 */
#define USB1_OTGN_ID_P2_13 A15X_MUX('2',13,8) /* PT2_13 */
#define CAN0_TXD_P2_13 A15X_MUX('2',13,11) /* PT2_13 */
#define TSI0_CH39_P2_13 A15X_MUX('2',13,12) /* PT2_13 */
#define P2_14 A15X_MUX('2',14,0) /* PT2_14 */
#define CT4_MAT2_P2_14 A15X_MUX('2',14,4) /* PT2_14 */
#define FLEXIO0_D22_P2_14 A15X_MUX('2',14,6) /* PT2_14 */
#define ADC0_A2_P2_15 A15X_MUX('2',15,0) /* PT2_15 */
#define P2_15 A15X_MUX('2',15,0) /* PT2_15 */
#define CMP0_INP4_P2_15 A15X_MUX('2',15,0) /* PT2_15 */
#define WUU0_IN21_P2_15 A15X_MUX('2',15,0) /* PT2_15 */
#define TRIG_OUT4_P2_15 A15X_MUX('2',15,1) /* PT2_15 */
#define LPSPI1_SDI_P2_15 A15X_MUX('2',15,2) /* PT2_15 */
#define LPUART1_RTS_B_P2_15 A15X_MUX('2',15,3) /* PT2_15 */
#define CT4_MAT3_P2_15 A15X_MUX('2',15,4) /* PT2_15 */
#define CT0_MAT2_P2_15 A15X_MUX('2',15,5) /* PT2_15 */
#define FLEXIO0_D23_P2_15 A15X_MUX('2',15,6) /* PT2_15 */
#define SMARTDMA_PIO18_P2_15 A15X_MUX('2',15,7) /* PT2_15 */
#define USB1_VBUSVALID_EXT_P2_15 A15X_MUX('2',15,8) /* PT2_15 */
#define CAN1_RXD_P2_15 A15X_MUX('2',15,11) /* PT2_15 */
#define TSI0_CH40_P2_15 A15X_MUX('2',15,12) /* PT2_15 */
#define P2_16 A15X_MUX('2',16,0) /* PT2_16 */
#define ADC0_A6_P2_16 A15X_MUX('2',16,0) /* PT2_16 */
#define LPSPI1_SDI_P2_16 A15X_MUX('2',16,2) /* PT2_16 */
#define LPUART1_RTS_B_P2_16 A15X_MUX('2',16,3) /* PT2_16 */
#define CT3_MAT0_P2_16 A15X_MUX('2',16,4) /* PT2_16 */
#define CT0_MAT2_P2_16 A15X_MUX('2',16,5) /* PT2_16 */
#define FLEXIO0_D24_P2_16 A15X_MUX('2',16,6) /* PT2_16 */
#define SMARTDMA_PIO19_P2_16 A15X_MUX('2',16,7) /* PT2_16 */
#define USB1_OTGN_PWR_P2_16 A15X_MUX('2',16,8) /* PT2_16 */
#define CAN1_TXD_P2_16 A15X_MUX('2',16,11) /* PT2_16 */
#define TSI0_CH41_P2_16 A15X_MUX('2',16,12) /* PT2_16 */
#define ADC1_A6_P2_17 A15X_MUX('2',17,0) /* PT2_17 */
#define P2_17 A15X_MUX('2',17,0) /* PT2_17 */
#define TRIG_IN9_P2_17 A15X_MUX('2',17,1) /* PT2_17 */
#define LPSPI1_PCS0_P2_17 A15X_MUX('2',17,2) /* PT2_17 */
#define LPUART1_CTS_B_P2_17 A15X_MUX('2',17,3) /* PT2_17 */
#define CT3_MAT1_P2_17 A15X_MUX('2',17,4) /* PT2_17 */
#define CT0_MAT3_P2_17 A15X_MUX('2',17,5) /* PT2_17 */
#define FLEXIO0_D25_P2_17 A15X_MUX('2',17,6) /* PT2_17 */
#define SMARTDMA_PIO20_P2_17 A15X_MUX('2',17,7) /* PT2_17 */
#define USB1_OTGN_OC_P2_17 A15X_MUX('2',17,8) /* PT2_17 */
#define TSI0_CH42_P2_17 A15X_MUX('2',17,12) /* PT2_17 */
#define P2_18 A15X_MUX('2',18,0) /* PT2_18 */
#define CT3_MAT2_P2_18 A15X_MUX('2',18,4) /* PT2_18 */
#define FLEXIO0_D26_P2_18 A15X_MUX('2',18,6) /* PT2_18 */
#define P2_19 A15X_MUX('2',19,0) /* PT2_19 */
#define ADC1_A2_P2_19 A15X_MUX('2',19,0) /* PT2_19 */
#define TRIG_OUT5_P2_19 A15X_MUX('2',19,1) /* PT2_19 */
#define CT3_MAT3_P2_19 A15X_MUX('2',19,4) /* PT2_19 */
#define FLEXIO0_D27_P2_19 A15X_MUX('2',19,6) /* PT2_19 */
#define SMARTDMA_PIO21_P2_19 A15X_MUX('2',19,7) /* PT2_19 */
#define TSI0_CH43_P2_19 A15X_MUX('2',19,12) /* PT2_19 */
#define P2_20 A15X_MUX('2',20,0) /* PT2_20 */
#define TRIG_IN8_P2_20 A15X_MUX('2',20,1) /* PT2_20 */
#define LPSPI1_PCS2_P2_20 A15X_MUX('2',20,2) /* PT2_20 */
#define CT2_MAT0_P2_20 A15X_MUX('2',20,4) /* PT2_20 */
#define FLEXIO0_D28_P2_20 A15X_MUX('2',20,6) /* PT2_20 */
#define SMARTDMA_PIO22_P2_20 A15X_MUX('2',20,7) /* PT2_20 */
#define TSI0_CH44_P2_20 A15X_MUX('2',20,12) /* PT2_20 */
#define P2_21 A15X_MUX('2',21,0) /* PT2_21 */
#define TRIG_IN9_P2_21 A15X_MUX('2',21,1) /* PT2_21 */
#define LPSPI1_PCS3_P2_21 A15X_MUX('2',21,2) /* PT2_21 */
#define CT2_MAT1_P2_21 A15X_MUX('2',21,4) /* PT2_21 */
#define FLEXIO0_D29_P2_21 A15X_MUX('2',21,6) /* PT2_21 */
#define SMARTDMA_PIO23_P2_21 A15X_MUX('2',21,7) /* PT2_21 */
#define TSI0_CH45_P2_21 A15X_MUX('2',21,12) /* PT2_21 */
#define P2_22 A15X_MUX('2',22,0) /* PT2_22 */
#define CT2_MAT2_P2_22 A15X_MUX('2',22,4) /* PT2_22 */
#define FLEXIO0_D30_P2_22 A15X_MUX('2',22,6) /* PT2_22 */
#define P2_23 A15X_MUX('2',23,0) /* PT2_23 */
#define CMP0_INP5_P2_23 A15X_MUX('2',23,0) /* PT2_23 */
#define TRIG_OUT5_P2_23 A15X_MUX('2',23,1) /* PT2_23 */
#define CT2_MAT3_P2_23 A15X_MUX('2',23,4) /* PT2_23 */
#define FLEXIO0_D31_P2_23 A15X_MUX('2',23,6) /* PT2_23 */
#define P2_24 A15X_MUX('2',24,0) /* PT2_24 */
#define TRIG_OUT6_P2_24 A15X_MUX('2',24,1) /* PT2_24 */
#define CT_INP8_P2_24 A15X_MUX('2',24,4) /* PT2_24 */
#define P2_25 A15X_MUX('2',25,0) /* PT2_25 */
#define TRIG_OUT7_P2_25 A15X_MUX('2',25,1) /* PT2_25 */
#define CT_INP9_P2_25 A15X_MUX('2',25,4) /* PT2_25 */
#define P2_26 A15X_MUX('2',26,0) /* PT2_26 */
#define TRIG_IN5_P2_26 A15X_MUX('2',26,1) /* PT2_26 */
#define CT_INP10_P2_26 A15X_MUX('2',26,4) /* PT2_26 */
#define TRIG_IN5/CT_INP10_P2_26_P2_26 A15X_MUX('2',26,4) /* PT2_26 */
#define P2_28 A15X_MUX('2',28,0) /* PT2_28 */
#define P2_29 A15X_MUX('2',29,0) /* PT2_29 */
#define P2_30 A15X_MUX('2',30,0) /* PT2_30 */
#define P2_31 A15X_MUX('2',31,0) /* PT2_31 */
#define P3_0 A15X_MUX('3',0,0) /* PT3_0 */
#define WUU0_IN22_P3_0 A15X_MUX('3',0,0) /* PT3_0 */
#define TRIG_IN0_P3_0 A15X_MUX('3',0,1) /* PT3_0 */
#define LPI2C3_SDA_P3_0 A15X_MUX('3',0,2) /* PT3_0 */
#define LPUART3_RXD_P3_0 A15X_MUX('3',0,3) /* PT3_0 */
#define CT_INP16_P3_0 A15X_MUX('3',0,4) /* PT3_0 */
#define TRIG_IN0/CT_INP16_P3_0_P3_0 A15X_MUX('3',0,4) /* PT3_0 */
#define FLEXIO0_D8_P3_0 A15X_MUX('3',0,6) /* PT3_0 */
#define LPSPI3_PCS0_P3_0 A15X_MUX('3',0,7) /* PT3_0 */
#define FLEXSPI0_A_SS0_B_P3_0 A15X_MUX('3',0,9) /* PT3_0 */
#define SMARTDMA_PIO0_P3_0 A15X_MUX('3',0,10) /* PT3_0 */
#define P3_1 A15X_MUX('3',1,0) /* PT3_1 */
#define TRIG_IN1_P3_1 A15X_MUX('3',1,1) /* PT3_1 */
#define LPI2C3_SCL_P3_1 A15X_MUX('3',1,2) /* PT3_1 */
#define LPUART3_TXD_P3_1 A15X_MUX('3',1,3) /* PT3_1 */
#define CT_INP17_P3_1 A15X_MUX('3',1,4) /* PT3_1 */
#define TRIG_IN1/CT_INP17_P3_1_P3_1 A15X_MUX('3',1,4) /* PT3_1 */
#define FLEXIO0_D9_P3_1 A15X_MUX('3',1,6) /* PT3_1 */
#define LPSPI3_PCS1_P3_1 A15X_MUX('3',1,7) /* PT3_1 */
#define FLEXSPI0_B_DQS_P3_1 A15X_MUX('3',1,8) /* PT3_1 */
#define FLEXSPI0_A_SS1_B_P3_1 A15X_MUX('3',1,9) /* PT3_1 */
#define SMARTDMA_PIO1_P3_1 A15X_MUX('3',1,10) /* PT3_1 */
#define P3_2 A15X_MUX('3',2,0) /* PT3_2 */
#define LPSPI1_PCS1_P3_2 A15X_MUX('3',2,2) /* PT3_2 */
#define LPSPI4_SDO_P3_2 A15X_MUX('3',2,3) /* PT3_2 */
#define CT4_MAT0_P3_2 A15X_MUX('3',2,4) /* PT3_2 */
#define FLEXIO0_D10_P3_2 A15X_MUX('3',2,6) /* PT3_2 */
#define SMARTDMA_PIO2_P3_2 A15X_MUX('3',2,10) /* PT3_2 */
#define TSI0_CH46_P3_2 A15X_MUX('3',2,12) /* PT3_2 */
#define P3_3 A15X_MUX('3',3,0) /* PT3_3 */
#define LPI2C3_HREQ_P3_3 A15X_MUX('3',3,2) /* PT3_3 */
#define LPSPI4_SCK_P3_3 A15X_MUX('3',3,3) /* PT3_3 */
#define CT4_MAT1_P3_3 A15X_MUX('3',3,4) /* PT3_3 */
#define FLEXIO0_D11_P3_3 A15X_MUX('3',3,6) /* PT3_3 */
#define SMARTDMA_PIO3_P3_3 A15X_MUX('3',3,10) /* PT3_3 */
#define TSI0_CH47_P3_3 A15X_MUX('3',3,12) /* PT3_3 */
#define P3_4 A15X_MUX('3',4,0) /* PT3_4 */
#define LPI2C3_SDAS_P3_4 A15X_MUX('3',4,2) /* PT3_4 */
#define LPSPI4_SDI_P3_4 A15X_MUX('3',4,3) /* PT3_4 */
#define CT_INP18_P3_4 A15X_MUX('3',4,4) /* PT3_4 */
#define FLEXIO0_D12_P3_4 A15X_MUX('3',4,6) /* PT3_4 */
#define SMARTDMA_PIO4_P3_4 A15X_MUX('3',4,10) /* PT3_4 */
#define TSI0_CH48_P3_4 A15X_MUX('3',4,12) /* PT3_4 */
#define P3_5 A15X_MUX('3',5,0) /* PT3_5 */
#define LPI2C3_SCLS_P3_5 A15X_MUX('3',5,2) /* PT3_5 */
#define LPSPI4_PCS0_P3_5 A15X_MUX('3',5,3) /* PT3_5 */
#define CT_INP19_P3_5 A15X_MUX('3',5,4) /* PT3_5 */
#define FLEXIO0_D13_P3_5 A15X_MUX('3',5,6) /* PT3_5 */
#define SMARTDMA_PIO5_P3_5 A15X_MUX('3',5,10) /* PT3_5 */
#define TSI0_CH49_P3_5 A15X_MUX('3',5,12) /* PT3_5 */
#define P3_6 A15X_MUX('3',6,0) /* PT3_6 */
#define CLKOUT_P3_6 A15X_MUX('3',6,1) /* PT3_6 */
#define LPSPI1_PCS3_P3_6 A15X_MUX('3',6,2) /* PT3_6 */
#define LPUART3_RTS_B_P3_6 A15X_MUX('3',6,3) /* PT3_6 */
#define CT4_MAT2_P3_6 A15X_MUX('3',6,4) /* PT3_6 */
#define FLEXIO0_D14_P3_6 A15X_MUX('3',6,6) /* PT3_6 */
#define LPSPI3_PCS1_P3_6 A15X_MUX('3',6,7) /* PT3_6 */
#define FLEXSPI0_B_SS1_B_P3_6 A15X_MUX('3',6,8) /* PT3_6 */
#define FLEXSPI0_A_DQS_P3_6 A15X_MUX('3',6,9) /* PT3_6 */
#define SMARTDMA_PIO6_P3_6 A15X_MUX('3',6,10) /* PT3_6 */
#define P3_7 A15X_MUX('3',7,0) /* PT3_7 */
#define TRIG_IN2_P3_7 A15X_MUX('3',7,1) /* PT3_7 */
#define LPSPI1_PCS2_P3_7 A15X_MUX('3',7,2) /* PT3_7 */
#define LPUART3_CTS_B_P3_7 A15X_MUX('3',7,3) /* PT3_7 */
#define CT4_MAT3_P3_7 A15X_MUX('3',7,4) /* PT3_7 */
#define FLEXIO0_D15_P3_7 A15X_MUX('3',7,6) /* PT3_7 */
#define LPSPI3_SCK_P3_7 A15X_MUX('3',7,7) /* PT3_7 */
#define FLEXSPI0_A_SCLK_P3_7 A15X_MUX('3',7,9) /* PT3_7 */
#define SMARTDMA_PIO7_P3_7 A15X_MUX('3',7,10) /* PT3_7 */
#define P3_8 A15X_MUX('3',8,0) /* PT3_8 */
#define WUU0_IN23_P3_8 A15X_MUX('3',8,0) /* PT3_8 */
#define TRIG_IN3_P3_8 A15X_MUX('3',8,1) /* PT3_8 */
#define LPSPI1_SDO_P3_8 A15X_MUX('3',8,2) /* PT3_8 */
#define LPUART1_RXD_P3_8 A15X_MUX('3',8,3) /* PT3_8 */
#define CT_INP4_P3_8 A15X_MUX('3',8,4) /* PT3_8 */
#define TRIG_IN3/CT_INP4_P3_8_P3_8 A15X_MUX('3',8,4) /* PT3_8 */
#define FLEXIO0_D16_P3_8 A15X_MUX('3',8,6) /* PT3_8 */
#define LPSPI3_SDO_P3_8 A15X_MUX('3',8,7) /* PT3_8 */
#define LPUART5_CTS_B_P3_8 A15X_MUX('3',8,8) /* PT3_8 */
#define FLEXSPI0_A_DATA0_P3_8 A15X_MUX('3',8,9) /* PT3_8 */
#define SMARTDMA_PIO8_P3_8 A15X_MUX('3',8,10) /* PT3_8 */
#define P3_9 A15X_MUX('3',9,0) /* PT3_9 */
#define TRIG_IN4_P3_9 A15X_MUX('3',9,1) /* PT3_9 */
#define LPSPI1_SDI_P3_9 A15X_MUX('3',9,2) /* PT3_9 */
#define LPUART1_TXD_P3_9 A15X_MUX('3',9,3) /* PT3_9 */
#define CT_INP5_P3_9 A15X_MUX('3',9,4) /* PT3_9 */
#define TRIG_IN4/CT_INP5_P3_9_P3_9 A15X_MUX('3',9,4) /* PT3_9 */
#define FLEXIO0_D17_P3_9 A15X_MUX('3',9,6) /* PT3_9 */
#define LPSPI3_SDI_P3_9 A15X_MUX('3',9,7) /* PT3_9 */
#define LPUART5_RTS_B_P3_9 A15X_MUX('3',9,8) /* PT3_9 */
#define FLEXSPI0_A_DATA1_P3_9 A15X_MUX('3',9,9) /* PT3_9 */
#define SMARTDMA_PIO9_P3_9 A15X_MUX('3',9,10) /* PT3_9 */
#define P3_10 A15X_MUX('3',10,0) /* PT3_10 */
#define TRIG_IN5_P3_10 A15X_MUX('3',10,1) /* PT3_10 */
#define LPSPI1_SCK_P3_10 A15X_MUX('3',10,2) /* PT3_10 */
#define LPUART1_RTS_B_P3_10 A15X_MUX('3',10,3) /* PT3_10 */
#define CT1_MAT0_P3_10 A15X_MUX('3',10,4) /* PT3_10 */
#define FLEXIO0_D18_P3_10 A15X_MUX('3',10,6) /* PT3_10 */
#define LPSPI3_PCS2_P3_10 A15X_MUX('3',10,7) /* PT3_10 */
#define LPUART5_TXD_P3_10 A15X_MUX('3',10,8) /* PT3_10 */
#define FLEXSPI0_A_DATA2_P3_10 A15X_MUX('3',10,9) /* PT3_10 */
#define SMARTDMA_PIO10_P3_10 A15X_MUX('3',10,10) /* PT3_10 */
#define P3_11 A15X_MUX('3',11,0) /* PT3_11 */
#define WUU0_IN24_P3_11 A15X_MUX('3',11,0) /* PT3_11 */
#define TRIG_IN6_P3_11 A15X_MUX('3',11,1) /* PT3_11 */
#define LPSPI1_PCS0_P3_11 A15X_MUX('3',11,2) /* PT3_11 */
#define LPUART1_CTS_B_P3_11 A15X_MUX('3',11,3) /* PT3_11 */
#define CT1_MAT1_P3_11 A15X_MUX('3',11,4) /* PT3_11 */
#define FLEXIO0_D19_P3_11 A15X_MUX('3',11,6) /* PT3_11 */
#define LPSPI3_PCS3_P3_11 A15X_MUX('3',11,7) /* PT3_11 */
#define LPUART5_RXD_P3_11 A15X_MUX('3',11,8) /* PT3_11 */
#define FLEXSPI0_A_DATA3_P3_11 A15X_MUX('3',11,9) /* PT3_11 */
#define SMARTDMA_PIO11_P3_11 A15X_MUX('3',11,10) /* PT3_11 */
#define P3_12 A15X_MUX('3',12,0) /* PT3_12 */
#define LPUART2_RTS_B_P3_12 A15X_MUX('3',12,2) /* PT3_12 */
#define LPUART3_TXD_P3_12 A15X_MUX('3',12,3) /* PT3_12 */
#define CT1_MAT2_P3_12 A15X_MUX('3',12,4) /* PT3_12 */
#define ESPI0_DATA3_P3_12 A15X_MUX('3',12,5) /* PT3_12 */
#define FLEXIO0_D20_P3_12 A15X_MUX('3',12,6) /* PT3_12 */
#define LPSPI3_PCS3_P3_12 A15X_MUX('3',12,7) /* PT3_12 */
#define FLEXSPI0_B_DATA3_P3_12 A15X_MUX('3',12,9) /* PT3_12 */
#define SMARTDMA_PIO12_P3_12 A15X_MUX('3',12,10) /* PT3_12 */
#define P3_13 A15X_MUX('3',13,0) /* PT3_13 */
#define LPUART2_CTS_B_P3_13 A15X_MUX('3',13,2) /* PT3_13 */
#define LPUART3_RXD_P3_13 A15X_MUX('3',13,3) /* PT3_13 */
#define CT1_MAT3_P3_13 A15X_MUX('3',13,4) /* PT3_13 */
#define ESPI0_DATA2_P3_13 A15X_MUX('3',13,5) /* PT3_13 */
#define FLEXIO0_D21_P3_13 A15X_MUX('3',13,6) /* PT3_13 */
#define LPSPI3_PCS2_P3_13 A15X_MUX('3',13,7) /* PT3_13 */
#define FLEXSPI0_B_DATA2_P3_13 A15X_MUX('3',13,9) /* PT3_13 */
#define SMARTDMA_PIO13_P3_13 A15X_MUX('3',13,10) /* PT3_13 */
#define P3_14 A15X_MUX('3',14,0) /* PT3_14 */
#define WUU0_IN25_P3_14 A15X_MUX('3',14,0) /* PT3_14 */
#define LPUART2_RXD_P3_14 A15X_MUX('3',14,2) /* PT3_14 */
#define LPUART3_CTS_B_P3_14 A15X_MUX('3',14,3) /* PT3_14 */
#define CT_INP6_P3_14 A15X_MUX('3',14,4) /* PT3_14 */
#define ESPI0_DATA1_P3_14 A15X_MUX('3',14,5) /* PT3_14 */
#define FLEXIO0_D22_P3_14 A15X_MUX('3',14,6) /* PT3_14 */
#define LPSPI3_SDI_P3_14 A15X_MUX('3',14,7) /* PT3_14 */
#define FLEXSPI0_B_DATA1_P3_14 A15X_MUX('3',14,9) /* PT3_14 */
#define SMARTDMA_PIO14_P3_14 A15X_MUX('3',14,10) /* PT3_14 */
#define P3_15 A15X_MUX('3',15,0) /* PT3_15 */
#define LPUART2_TXD_P3_15 A15X_MUX('3',15,2) /* PT3_15 */
#define LPUART3_RTS_B_P3_15 A15X_MUX('3',15,3) /* PT3_15 */
#define CT_INP7_P3_15 A15X_MUX('3',15,4) /* PT3_15 */
#define ESPI0_DATA0_P3_15 A15X_MUX('3',15,5) /* PT3_15 */
#define FLEXIO0_D23_P3_15 A15X_MUX('3',15,6) /* PT3_15 */
#define LPSPI3_SDO_P3_15 A15X_MUX('3',15,7) /* PT3_15 */
#define FLEXSPI0_B_DATA0_P3_15 A15X_MUX('3',15,9) /* PT3_15 */
#define SMARTDMA_PIO15_P3_15 A15X_MUX('3',15,10) /* PT3_15 */
#define P3_16 A15X_MUX('3',16,0) /* PT3_16 */
#define LPUART4_RTS_B_P3_16 A15X_MUX('3',16,2) /* PT3_16 */
#define CT_INP8_P3_16 A15X_MUX('3',16,4) /* PT3_16 */
#define ESPI0_CLK_P3_16 A15X_MUX('3',16,5) /* PT3_16 */
#define FLEXIO0_D24_P3_16 A15X_MUX('3',16,6) /* PT3_16 */
#define LPSPI3_SCK_P3_16 A15X_MUX('3',16,7) /* PT3_16 */
#define FLEXSPI0_B_SCLK_P3_16 A15X_MUX('3',16,9) /* PT3_16 */
#define SMARTDMA_PIO16_P3_16 A15X_MUX('3',16,10) /* PT3_16 */
#define WUU0_IN26_P3_17 A15X_MUX('3',17,0) /* PT3_17 */
#define P3_17 A15X_MUX('3',17,0) /* PT3_17 */
#define LPUART4_CTS_B_P3_17 A15X_MUX('3',17,2) /* PT3_17 */
#define CT_INP9_P3_17 A15X_MUX('3',17,4) /* PT3_17 */
#define ESPI0_CSN_P3_17 A15X_MUX('3',17,5) /* PT3_17 */
#define FLEXIO0_D25_P3_17 A15X_MUX('3',17,6) /* PT3_17 */
#define LPSPI3_PCS0_P3_17 A15X_MUX('3',17,7) /* PT3_17 */
#define FLEXSPI0_B_SS0_B_P3_17 A15X_MUX('3',17,9) /* PT3_17 */
#define SMARTDMA_PIO17_P3_17 A15X_MUX('3',17,10) /* PT3_17 */
#define P3_18 A15X_MUX('3',18,0) /* PT3_18 */
#define LPUART4_RXD_P3_18 A15X_MUX('3',18,2) /* PT3_18 */
#define CT2_MAT0_P3_18 A15X_MUX('3',18,4) /* PT3_18 */
#define FLEXIO0_D26_P3_18 A15X_MUX('3',18,6) /* PT3_18 */
#define SMARTDMA_PIO18_P3_18 A15X_MUX('3',18,10) /* PT3_18 */
#define TSI0_CH50_P3_18 A15X_MUX('3',18,12) /* PT3_18 */
#define P3_19 A15X_MUX('3',19,0) /* PT3_19 */
#define LPUART4_TXD_P3_19 A15X_MUX('3',19,2) /* PT3_19 */
#define CT2_MAT1_P3_19 A15X_MUX('3',19,4) /* PT3_19 */
#define FLEXIO0_D27_P3_19 A15X_MUX('3',19,6) /* PT3_19 */
#define SMARTDMA_PIO19_P3_19 A15X_MUX('3',19,10) /* PT3_19 */
#define TSI0_CH51_P3_19 A15X_MUX('3',19,12) /* PT3_19 */
#define P3_20 A15X_MUX('3',20,0) /* PT3_20 */
#define WUU0_IN27_P3_20 A15X_MUX('3',20,0) /* PT3_20 */
