zephyrproject-rtos/hal_nxp/dts/nxp/mcx/mcxa/pinctrl/MCXA577VPN-pinctrl.h
#define TRIG_OUT0_P3_20 A15X_MUX('3',20,1) /* PT3_20 */
#define LPI2C3_SDA_P3_20 A15X_MUX('3',20,2) /* PT3_20 */
#define LPUART1_RXD_P3_20 A15X_MUX('3',20,3) /* PT3_20 */
#define CT2_MAT2_P3_20 A15X_MUX('3',20,4) /* PT3_20 */
#define ESPI0_NOTIFY_P3_20 A15X_MUX('3',20,5) /* PT3_20 */
#define FLEXIO0_D28_P3_20 A15X_MUX('3',20,6) /* PT3_20 */
#define LPSPI3_SDO_P3_20 A15X_MUX('3',20,7) /* PT3_20 */
#define SMARTDMA_PIO20_P3_20 A15X_MUX('3',20,10) /* PT3_20 */
#define TSI0_CH52_P3_20 A15X_MUX('3',20,12) /* PT3_20 */
#define P3_21 A15X_MUX('3',21,0) /* PT3_21 */
#define TRIG_OUT1_P3_21 A15X_MUX('3',21,1) /* PT3_21 */
#define LPI2C3_SCL_P3_21 A15X_MUX('3',21,2) /* PT3_21 */
#define LPUART1_TXD_P3_21 A15X_MUX('3',21,3) /* PT3_21 */
#define CT2_MAT3_P3_21 A15X_MUX('3',21,4) /* PT3_21 */
#define ESPI0_RST_P3_21 A15X_MUX('3',21,5) /* PT3_21 */
#define FLEXIO0_D29_P3_21 A15X_MUX('3',21,6) /* PT3_21 */
#define LPSPI3_SCK_P3_21 A15X_MUX('3',21,7) /* PT3_21 */
#define SMARTDMA_PIO21_P3_21 A15X_MUX('3',21,10) /* PT3_21 */
#define TSI0_CH53_P3_21 A15X_MUX('3',21,12) /* PT3_21 */
#define P3_22 A15X_MUX('3',22,0) /* PT3_22 */
#define LPI2C3_SCLS_P3_22 A15X_MUX('3',22,2) /* PT3_22 */
#define LPUART1_RTS_B_P3_22 A15X_MUX('3',22,3) /* PT3_22 */
#define CT_INP10_P3_22 A15X_MUX('3',22,4) /* PT3_22 */
#define FLEXIO0_D30_P3_22 A15X_MUX('3',22,6) /* PT3_22 */
#define LPSPI3_SDI_P3_22 A15X_MUX('3',22,7) /* PT3_22 */
#define SMARTDMA_PIO22_P3_22 A15X_MUX('3',22,10) /* PT3_22 */
#define TSI0_CH54_P3_22 A15X_MUX('3',22,12) /* PT3_22 */
#define P3_23 A15X_MUX('3',23,0) /* PT3_23 */
#define LPI2C3_SDAS_P3_23 A15X_MUX('3',23,2) /* PT3_23 */
#define LPUART1_CTS_B_P3_23 A15X_MUX('3',23,3) /* PT3_23 */
#define CT_INP11_P3_23 A15X_MUX('3',23,4) /* PT3_23 */
#define FLEXIO0_D31_P3_23 A15X_MUX('3',23,6) /* PT3_23 */
#define LPSPI3_PCS0_P3_23 A15X_MUX('3',23,7) /* PT3_23 */
#define SMARTDMA_PIO23_P3_23 A15X_MUX('3',23,10) /* PT3_23 */
#define TSI0_CH55_P3_23 A15X_MUX('3',23,12) /* PT3_23 */
#define P3_24 A15X_MUX('3',24,0) /* PT3_24 */
#define LPI2C3_HREQ_P3_24 A15X_MUX('3',24,2) /* PT3_24 */
#define LPSPI4_PCS3_P3_24 A15X_MUX('3',24,3) /* PT3_24 */
#define CT_INP16_P3_24 A15X_MUX('3',24,4) /* PT3_24 */
#define FLEXIO0_D24_P3_24 A15X_MUX('3',24,6) /* PT3_24 */
#define LPSPI3_PCS3_P3_24 A15X_MUX('3',24,7) /* PT3_24 */
#define SMARTDMA_PIO24_P3_24 A15X_MUX('3',24,10) /* PT3_24 */
#define TSI0_CH56_P3_24 A15X_MUX('3',24,12) /* PT3_24 */
#define P3_25 A15X_MUX('3',25,0) /* PT3_25 */
#define LPSPI4_PCS2_P3_25 A15X_MUX('3',25,3) /* PT3_25 */
#define CT_INP15_P3_25 A15X_MUX('3',25,4) /* PT3_25 */
#define FLEXIO0_D25_P3_25 A15X_MUX('3',25,6) /* PT3_25 */
#define LPSPI3_PCS2_P3_25 A15X_MUX('3',25,7) /* PT3_25 */
#define SMARTDMA_PIO25_P3_25 A15X_MUX('3',25,10) /* PT3_25 */
#define TSI0_CH57_P3_25 A15X_MUX('3',25,12) /* PT3_25 */
#define P3_26 A15X_MUX('3',26,0) /* PT3_26 */
#define LPSPI4_PCS1_P3_26 A15X_MUX('3',26,3) /* PT3_26 */
#define CT_INP14_P3_26 A15X_MUX('3',26,4) /* PT3_26 */
#define FLEXIO0_D26_P3_26 A15X_MUX('3',26,6) /* PT3_26 */
#define LPSPI3_PCS1_P3_26 A15X_MUX('3',26,7) /* PT3_26 */
#define SMARTDMA_PIO26_P3_26 A15X_MUX('3',26,10) /* PT3_26 */
#define P3_27 A15X_MUX('3',27,0) /* PT3_27 */
#define LPI2C3_SCL_P3_27 A15X_MUX('3',27,2) /* PT3_27 */
#define LPUART4_TXD_P3_27 A15X_MUX('3',27,3) /* PT3_27 */
#define CT_INP13_P3_27 A15X_MUX('3',27,4) /* PT3_27 */
#define CT3_MAT1_P3_27 A15X_MUX('3',27,5) /* PT3_27 */
#define FLEXIO0_D27_P3_27 A15X_MUX('3',27,6) /* PT3_27 */
#define SMARTDMA_PIO27_P3_27 A15X_MUX('3',27,10) /* PT3_27 */
#define P4_0 A15X_MUX('4',0,0) /* PT4_0 */
#define TRIG_IN5_P4_0 A15X_MUX('4',0,1) /* PT4_0 */
#define LPI2C3_SDA_P4_0 A15X_MUX('4',0,2) /* PT4_0 */
#define CT_INP4_P4_0 A15X_MUX('4',0,4) /* PT4_0 */
#define TRIG_IN5/CT_INP4_P4_0_P4_0 A15X_MUX('4',0,4) /* PT4_0 */
#define FLEXIO0_D8_P4_0 A15X_MUX('4',0,6) /* PT4_0 */
#define SMARTDMA_PIO20_P4_0 A15X_MUX('4',0,7) /* PT4_0 */
#define LPSPI2_PCS1_P4_0 A15X_MUX('4',0,8) /* PT4_0 */
#define I3C2_PUR_P4_0 A15X_MUX('4',0,10) /* PT4_0 */
#define TSI0_CH58_P4_0 A15X_MUX('4',0,12) /* PT4_0 */
#define P4_1 A15X_MUX('4',1,0) /* PT4_1 */
#define LPI2C3_SCL_P4_1 A15X_MUX('4',1,2) /* PT4_1 */
#define CT_INP5_P4_1 A15X_MUX('4',1,4) /* PT4_1 */
#define FLEXIO0_D9_P4_1 A15X_MUX('4',1,6) /* PT4_1 */
#define SMARTDMA_PIO21_P4_1 A15X_MUX('4',1,7) /* PT4_1 */
#define LPSPI5_PCS1_P4_1 A15X_MUX('4',1,8) /* PT4_1 */
#define I3C3_PUR_P4_1 A15X_MUX('4',1,10) /* PT4_1 */
#define TSI0_CH59_P4_1 A15X_MUX('4',1,12) /* PT4_1 */
#define WUU0_IN16_P4_2 A15X_MUX('4',2,0) /* PT4_2 */
#define P4_2 A15X_MUX('4',2,0) /* PT4_2 */
#define CLKOUT_P4_2 A15X_MUX('4',2,1) /* PT4_2 */
#define LPI2C2_SDAS_P4_2 A15X_MUX('4',2,2) /* PT4_2 */
#define LPUART3_RXD_P4_2 A15X_MUX('4',2,3) /* PT4_2 */
#define CT4_MAT0_P4_2 A15X_MUX('4',2,4) /* PT4_2 */
#define FLEXIO0_D10_P4_2 A15X_MUX('4',2,6) /* PT4_2 */
#define SMARTDMA_PIO22_P4_2 A15X_MUX('4',2,7) /* PT4_2 */
#define LPSPI2_PCS0_P4_2 A15X_MUX('4',2,8) /* PT4_2 */
#define I3C3_SDA_P4_2 A15X_MUX('4',2,10) /* PT4_2 */
#define TSI0_CH60_P4_2 A15X_MUX('4',2,12) /* PT4_2 */
#define P4_3 A15X_MUX('4',3,0) /* PT4_3 */
#define LPI2C2_SCL_P4_3 A15X_MUX('4',3,2) /* PT4_3 */
#define LPUART4_TXD_P4_3 A15X_MUX('4',3,3) /* PT4_3 */
#define CT4_MAT1_P4_3 A15X_MUX('4',3,4) /* PT4_3 */
#define FLEXIO0_D11_P4_3 A15X_MUX('4',3,6) /* PT4_3 */
#define SMARTDMA_PIO23_P4_3 A15X_MUX('4',3,7) /* PT4_3 */
#define LPSPI2_SCK_P4_3 A15X_MUX('4',3,8) /* PT4_3 */
#define I3C2_SCL_P4_3 A15X_MUX('4',3,10) /* PT4_3 */
#define TSI0_CH61_P4_3 A15X_MUX('4',3,12) /* PT4_3 */
#define P4_4 A15X_MUX('4',4,0) /* PT4_4 */
#define WUU0_IN17_P4_4 A15X_MUX('4',4,0) /* PT4_4 */
#define LPI2C2_SDA_P4_4 A15X_MUX('4',4,2) /* PT4_4 */
#define LPUART4_RXD_P4_4 A15X_MUX('4',4,3) /* PT4_4 */
#define CT4_MAT2_P4_4 A15X_MUX('4',4,4) /* PT4_4 */
#define FLEXIO0_D12_P4_4 A15X_MUX('4',4,6) /* PT4_4 */
#define SMARTDMA_PIO24_P4_4 A15X_MUX('4',4,7) /* PT4_4 */
#define LPSPI2_SDO_P4_4 A15X_MUX('4',4,8) /* PT4_4 */
#define I3C2_SDA_P4_4 A15X_MUX('4',4,10) /* PT4_4 */
#define TSI0_CH62_P4_4 A15X_MUX('4',4,12) /* PT4_4 */
#define P4_5 A15X_MUX('4',5,0) /* PT4_5 */
#define TRIG_OUT3_P4_5 A15X_MUX('4',5,1) /* PT4_5 */
#define LPI2C2_SCLS_P4_5 A15X_MUX('4',5,2) /* PT4_5 */
#define LPUART3_TXD_P4_5 A15X_MUX('4',5,3) /* PT4_5 */
#define CT4_MAT3_P4_5 A15X_MUX('4',5,4) /* PT4_5 */
#define FLEXIO0_D13_P4_5 A15X_MUX('4',5,6) /* PT4_5 */
#define SMARTDMA_PIO25_P4_5 A15X_MUX('4',5,7) /* PT4_5 */
#define LPSPI2_SDI_P4_5 A15X_MUX('4',5,8) /* PT4_5 */
#define I3C3_SCL_P4_5 A15X_MUX('4',5,10) /* PT4_5 */
#define TSI0_CH63_P4_5 A15X_MUX('4',5,12) /* PT4_5 */
#define P4_6 A15X_MUX('4',6,0) /* PT4_6 */
#define TRIG_IN4_P4_6 A15X_MUX('4',6,1) /* PT4_6 */
#define LPI2C2_HREQ_P4_6 A15X_MUX('4',6,2) /* PT4_6 */
#define LPUART3_CTS_B_P4_6 A15X_MUX('4',6,3) /* PT4_6 */
#define CT_INP6_P4_6 A15X_MUX('4',6,4) /* PT4_6 */
#define TRIG_IN4/CT_INP6_P4_6_P4_6 A15X_MUX('4',6,4) /* PT4_6 */
#define FLEXIO0_D14_P4_6 A15X_MUX('4',6,6) /* PT4_6 */
#define SMARTDMA_PIO26_P4_6 A15X_MUX('4',6,7) /* PT4_6 */
#define LPSPI2_PCS2_P4_6 A15X_MUX('4',6,8) /* PT4_6 */
#define I3C3_SCL_P4_6 A15X_MUX('4',6,10) /* PT4_6 */
#define ESPI0_RST_P4_6 A15X_MUX('4',6,11) /* PT4_6 */
#define TSI0_CH64_P4_6 A15X_MUX('4',6,12) /* PT4_6 */
#define P4_7 A15X_MUX('4',7,0) /* PT4_7 */
#define TRIG_IN5_P4_7 A15X_MUX('4',7,1) /* PT4_7 */
#define LPI2C3_HREQ_P4_7 A15X_MUX('4',7,2) /* PT4_7 */
#define LPUART3_RTS_B_P4_7 A15X_MUX('4',7,3) /* PT4_7 */
#define CT_INP7_P4_7 A15X_MUX('4',7,4) /* PT4_7 */
#define TRIG_IN5/CT_INP7_P4_7_P4_7 A15X_MUX('4',7,4) /* PT4_7 */
#define FLEXIO0_D15_P4_7 A15X_MUX('4',7,6) /* PT4_7 */
#define SMARTDMA_PIO27_P4_7 A15X_MUX('4',7,7) /* PT4_7 */
#define LPSPI2_PCS3_P4_7 A15X_MUX('4',7,8) /* PT4_7 */
#define I3C3_SDA_P4_7 A15X_MUX('4',7,10) /* PT4_7 */
#define ESPI0_NOTIFY_P4_7 A15X_MUX('4',7,11) /* PT4_7 */
#define TSI0_CH65_P4_7 A15X_MUX('4',7,12) /* PT4_7 */
#define P4_8 A15X_MUX('4',8,0) /* PT4_8 */
#define LPUART0_RXD_P4_8 A15X_MUX('4',8,2) /* PT4_8 */
#define LPI2C4_SDAS_P4_8 A15X_MUX('4',8,3) /* PT4_8 */
#define CT_INP8_P4_8 A15X_MUX('4',8,4) /* PT4_8 */
#define FLEXIO0_D16_P4_8 A15X_MUX('4',8,6) /* PT4_8 */
#define SMARTDMA_PIO28_P4_8 A15X_MUX('4',8,7) /* PT4_8 */
#define LPSPI5_SDI_P4_8 A15X_MUX('4',8,8) /* PT4_8 */
#define ESPI0_DATA1_P4_8 A15X_MUX('4',8,11) /* PT4_8 */
#define TSI0_CH66_P4_8 A15X_MUX('4',8,12) /* PT4_8 */
#define P4_9 A15X_MUX('4',9,0) /* PT4_9 */
#define LPUART0_TXD_P4_9 A15X_MUX('4',9,2) /* PT4_9 */
#define LPI2C4_SCLS_P4_9 A15X_MUX('4',9,3) /* PT4_9 */
#define CT_INP9_P4_9 A15X_MUX('4',9,4) /* PT4_9 */
#define FLEXIO0_D17_P4_9 A15X_MUX('4',9,6) /* PT4_9 */
#define SMARTDMA_PIO29_P4_9 A15X_MUX('4',9,7) /* PT4_9 */
#define LPSPI5_SDO_P4_9 A15X_MUX('4',9,8) /* PT4_9 */
#define ESPI0_DATA0_P4_9 A15X_MUX('4',9,11) /* PT4_9 */
#define TSI0_CH67_P4_9 A15X_MUX('4',9,12) /* PT4_9 */
#define P4_10 A15X_MUX('4',10,0) /* PT4_10 */
#define LPUART0_RTS_B_P4_10 A15X_MUX('4',10,2) /* PT4_10 */
#define LPI2C4_SCL_P4_10 A15X_MUX('4',10,3) /* PT4_10 */
#define CT3_MAT0_P4_10 A15X_MUX('4',10,4) /* PT4_10 */
#define FLEXIO0_D18_P4_10 A15X_MUX('4',10,6) /* PT4_10 */
#define SMARTDMA_PIO30_P4_10 A15X_MUX('4',10,7) /* PT4_10 */
#define LPSPI5_SCK_P4_10 A15X_MUX('4',10,8) /* PT4_10 */
#define ESPI0_CLK_P4_10 A15X_MUX('4',10,11) /* PT4_10 */
#define TSI0_CH68_P4_10 A15X_MUX('4',10,12) /* PT4_10 */
#define P4_11 A15X_MUX('4',11,0) /* PT4_11 */
#define LPUART0_CTS_B_P4_11 A15X_MUX('4',11,2) /* PT4_11 */
#define LPI2C4_SDA_P4_11 A15X_MUX('4',11,3) /* PT4_11 */
#define CT3_MAT1_P4_11 A15X_MUX('4',11,4) /* PT4_11 */
#define FLEXIO0_D19_P4_11 A15X_MUX('4',11,6) /* PT4_11 */
#define SMARTDMA_PIO31_P4_11 A15X_MUX('4',11,7) /* PT4_11 */
#define LPSPI5_PCS0_P4_11 A15X_MUX('4',11,8) /* PT4_11 */
#define ESPI0_CSN_P4_11 A15X_MUX('4',11,11) /* PT4_11 */
#define TSI0_CH69_P4_11 A15X_MUX('4',11,12) /* PT4_11 */
#define P4_12 A15X_MUX('4',12,0) /* PT4_12 */
#define LPI2C3_SCLS_P4_12 A15X_MUX('4',12,2) /* PT4_12 */
#define CT3_MAT2_P4_12 A15X_MUX('4',12,4) /* PT4_12 */
#define LPSPI5_PCS3_P4_12 A15X_MUX('4',12,8) /* PT4_12 */
#define I3C2_PUR_P4_12 A15X_MUX('4',12,10) /* PT4_12 */
#define ESPI0_DATA3_P4_12 A15X_MUX('4',12,11) /* PT4_12 */
#define P4_13 A15X_MUX('4',13,0) /* PT4_13 */
#define LPI2C3_SDAS_P4_13 A15X_MUX('4',13,2) /* PT4_13 */
#define LPI2C4_HREQ_P4_13 A15X_MUX('4',13,3) /* PT4_13 */
#define CT3_MAT3_P4_13 A15X_MUX('4',13,4) /* PT4_13 */
#define LPSPI5_PCS2_P4_13 A15X_MUX('4',13,8) /* PT4_13 */
#define I3C3_PUR_P4_13 A15X_MUX('4',13,10) /* PT4_13 */
#define ESPI0_DATA2_P4_13 A15X_MUX('4',13,11) /* PT4_13 */
#define P5_0 A15X_MUX('5',0,0) /* PT5_0 */
#define ADC1_A20_P5_0 A15X_MUX('5',0,0) /* PT5_0 */
#define EXTAL32K_P5_0 A15X_MUX('5',0,0) /* PT5_0 */
#define TRIG_IN10_P5_0 A15X_MUX('5',0,1) /* PT5_0 */
#define LPTMR0_ALT2_P5_0 A15X_MUX('5',0,2) /* PT5_0 */
#define ADC1_A21_P5_1 A15X_MUX('5',1,0) /* PT5_1 */
#define P5_1 A15X_MUX('5',1,0) /* PT5_1 */
#define XTAL32K_P5_1 A15X_MUX('5',1,0) /* PT5_1 */
#define TRIG_OUT6_P5_1 A15X_MUX('5',1,1) /* PT5_1 */
#define ADC1_A22_P5_2 A15X_MUX('5',2,0) /* PT5_2 */
#define P5_2 A15X_MUX('5',2,0) /* PT5_2 */
#define VBAT_WAKEUP_B_P5_2 A15X_MUX('5',2,1) /* PT5_2 */
#define SPC_LPREQ_P5_2 A15X_MUX('5',2,2) /* PT5_2 */
#define TAMPER0_P5_2 A15X_MUX('5',2,3) /* PT5_2 */
#define P5_3 A15X_MUX('5',3,0) /* PT5_3 */
#define TRIG_IN11_P5_3 A15X_MUX('5',3,1) /* PT5_3 */
#define RTC_CLKOUT_P5_3 A15X_MUX('5',3,2) /* PT5_3 */
#define TAMPER1_P5_3 A15X_MUX('5',3,3) /* PT5_3 */
#define TSI0_CH0_P5_3 A15X_MUX('5',3,7) /* PT5_3 */
#define P5_4 A15X_MUX('5',4,0) /* PT5_4 */
#define TRIG_OUT7_P5_4 A15X_MUX('5',4,1) /* PT5_4 */
#define SPC_LPREQ_P5_4 A15X_MUX('5',4,2) /* PT5_4 */
#define TAMPER2_P5_4 A15X_MUX('5',4,3) /* PT5_4 */
#define TSI0_CH1_P5_4 A15X_MUX('5',4,7) /* PT5_4 */
#define P5_5 A15X_MUX('5',5,0) /* PT5_5 */
#define TRIG_IN10_P5_5 A15X_MUX('5',5,1) /* PT5_5 */
#define LPTMR0_ALT2_P5_5 A15X_MUX('5',5,2) /* PT5_5 */
#define TAMPER3_P5_5 A15X_MUX('5',5,3) /* PT5_5 */
#define TSI0_CH2_P5_5 A15X_MUX('5',5,7) /* PT5_5 */
#define P5_6 A15X_MUX('5',6,0) /* PT5_6 */
#define TRIG_OUT6_P5_6 A15X_MUX('5',6,1) /* PT5_6 */
#define TAMPER4_P5_6 A15X_MUX('5',6,3) /* PT5_6 */
#define TSI0_CH3_P5_6 A15X_MUX('5',6,7) /* PT5_6 */
#define P5_7 A15X_MUX('5',7,0) /* PT5_7 */
#define TRIG_IN11_P5_7 A15X_MUX('5',7,1) /* PT5_7 */
#define TAMPER5_P5_7 A15X_MUX('5',7,3) /* PT5_7 */
#define P5_8 A15X_MUX('5',8,0) /* PT5_8 */
#define TAMPER6_P5_8 A15X_MUX('5',8,3) /* PT5_8 */
#define P5_9 A15X_MUX('5',9,0) /* PT5_9 */
#define TAMPER7_P5_9 A15X_MUX('5',9,3) /* PT5_9 */
#endif
